
## ✅ Terraform Plan Succeeded

**Workflow**: [20509357391](https://github.com/wangzitian0/infra/actions/runs/20509357391)

<details>
<summary>📋 Plan Output</summary>

### 📦 platform

```terraform
18:40:42.730 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
18:40:45.414 STDOUT terraform: terraform_data.health_check_target[0]: Refreshing state... [id=ff153b72-191c-4599-018f-65a742e9eb4d]
18:40:45.414 STDOUT terraform: terraform_data.portal_sso_precheck: Refreshing state... [id=a912d9c3-6b86-ef7f-b2b4-f4e56f422964]
18:40:45.414 STDOUT terraform: terraform_data.domain_config_check: Refreshing state... [id=28e073ad-b9b0-a028-2f69-65fbcddfbbb1]
18:40:45.421 STDOUT terraform: vault_auth_backend.kubernetes: Refreshing state... [id=kubernetes]
18:40:45.421 STDOUT terraform: random_id.kubero_session_secret: Refreshing state... [id=zeyCGHUvA37amm8E6hBavxw1k-T73Gv83nhjVj8AhKc]
18:40:45.423 STDOUT terraform: random_password.dashboard_oidc_client_secret[0]: Refreshing state... [id=none]
18:40:45.425 STDOUT terraform: random_password.portal_cookie_secret[0]: Refreshing state... [id=none]
18:40:45.425 STDOUT terraform: data.cloudflare_zone.internal: Reading...
18:40:45.425 STDOUT terraform: random_password.portal_gate_client_secret[0]: Refreshing state... [id=none]
18:40:45.425 STDOUT terraform: random_id.kubero_webhook_secret: Refreshing state... [id=dhHyw_8bNByDLHGDFFTJ8TbDQlIu-RYg9XSKtAo5dBI]
18:40:45.425 STDOUT terraform: random_password.kubero_oidc_client_secret[0]: Refreshing state... [id=none]
18:40:45.429 STDOUT terraform: random_password.vault_oidc_client_secret[0]: Refreshing state... [id=none]
18:40:45.439 STDOUT terraform: vault_policy.admin[0]: Refreshing state... [id=admin]
18:40:45.442 STDOUT terraform: vault_policy.default: Refreshing state... [id=default]
18:40:45.451 STDOUT terraform: vault_identity_group.viewer[0]: Refreshing state... [id=89e06fbb-fc87-9471-ecc7-04b5747e4b06]
18:40:45.455 STDOUT terraform: vault_policy.vso_reader: Refreshing state... [id=vso-reader]
18:40:45.467 STDOUT terraform: vault_policy.viewer[0]: Refreshing state... [id=viewer]
18:40:45.467 STDOUT terraform: vault_policy.kubero: Refreshing state... [id=kubero]
18:40:45.471 STDOUT terraform: vault_identity_group.admin[0]: Refreshing state... [id=0ac3b38e-52bb-3a86-d72d-71ad31784ee3]
18:40:45.471 STDOUT terraform: data.vault_kv_secret_v2.signoz_clickhouse: Reading...
18:40:45.883 STDOUT terraform: data.cloudflare_zone.internal: Read complete after 1s [id=6e69310ba4000e47c0a2480e2606713a]
18:40:45.884 STDOUT terraform: vault_policy.developer[0]: Refreshing state... [id=developer]
18:40:46.759 STDOUT terraform: vault_identity_group.developer[0]: Refreshing state... [id=f7e4fa30-a522-c524-6927-6e0f8c21d4f3]
18:40:46.760 STDOUT terraform: kubernetes_namespace.observability: Refreshing state... [id=observability]
18:40:46.760 STDOUT terraform: kubernetes_namespace.kubero_operator_system: Refreshing state... [id=kubero-operator-system]
18:40:46.786 STDOUT terraform: data.vault_kv_secret_v2.signoz_clickhouse: Read complete after 2s [id=secret/data/signoz]
18:40:46.789 STDOUT terraform: data.kubernetes_namespace.platform: Reading...
18:40:46.793 STDOUT terraform: vault_policy.reader[0]: Refreshing state... [id=reader]
18:40:46.795 STDOUT terraform: vault_kubernetes_auth_backend_config.config: Refreshing state... [id=auth/kubernetes/config]
18:40:46.795 STDOUT terraform: vault_kubernetes_auth_backend_role.vso: Refreshing state... [id=auth/kubernetes/role/vault-secrets-operator]
18:40:46.795 STDOUT terraform: vault_kubernetes_auth_backend_role.kubero: Refreshing state... [id=auth/kubernetes/role/kubero]
18:40:47.364 STDOUT terraform: data.kubernetes_namespace.platform: Read complete after 0s [id=platform]
18:40:47.369 STDOUT terraform: kubernetes_service_account.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
18:40:47.369 STDOUT terraform: kubernetes_config_map.casdoor_init_data[0]: Refreshing state... [id=platform/casdoor-init-data]
18:40:47.369 STDOUT terraform: kubernetes_config_map.homer_config[0]: Refreshing state... [id=platform/homer-config]
18:40:47.369 STDOUT terraform: data.kubernetes_secret.casdoor_builtin: Reading...
18:40:47.370 STDOUT terraform: helm_release.vault: Refreshing state... [id=vault]
18:40:47.370 STDOUT terraform: helm_release.kubernetes_dashboard: Refreshing state... [id=kubernetes-dashboard]
18:40:47.371 STDOUT terraform: kubernetes_service.homer[0]: Refreshing state... [id=platform/homer]
18:40:47.582 STDOUT terraform: kubectl_manifest.kubero_operator[36]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-editor-role]
18:40:47.582 STDOUT terraform: kubectl_manifest.kubero_operator[37]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-viewer-role]
18:40:47.582 STDOUT terraform: kubectl_manifest.kubero_operator[4]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonrabbitmqs.application.kubero.dev]
18:40:47.582 STDOUT terraform: data.kubernetes_secret.casdoor_builtin: Read complete after 1s [id=platform/casdoor-builtin-secret]
18:40:47.585 STDOUT terraform: kubectl_manifest.kubero_operator[20]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoredis.application.kubero.dev]
18:40:47.777 STDOUT terraform: kubectl_manifest.kubero_operator[38]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-admin-role]
18:40:47.780 STDOUT terraform: kubectl_manifest.kubero_operator[29]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-admin-role]
18:40:47.821 STDOUT terraform: kubectl_manifest.kubero_operator[35]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-admin-role]
18:40:47.825 STDOUT terraform: kubectl_manifest.kubero_operator[2]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmysqls.application.kubero.dev]
18:40:49.345 STDOUT terraform: kubectl_manifest.kubero_operator[40]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-viewer-role]
18:40:49.348 STDOUT terraform: kubectl_manifest.kubero_operator[31]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-viewer-role]
18:40:49.348 STDOUT terraform: kubectl_manifest.kubero_operator[7]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberobuilds.application.kubero.dev]
18:40:49.422 STDOUT terraform: kubectl_manifest.kubero_operator[19]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberorabbitmqs.application.kubero.dev]
18:40:49.424 STDOUT terraform: kubectl_manifest.kubero_operator[6]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoapps.application.kubero.dev]
18:40:49.480 STDOUT terraform: kubectl_manifest.kubero_operator[27]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-editor-role]
18:40:49.536 STDOUT terraform: kubectl_manifest.kubero_operator[17]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopostgresqls.application.kubero.dev]
18:40:49.554 STDOUT terraform: kubectl_manifest.kubero_operator[1]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmongodbs.application.kubero.dev]
18:40:49.558 STDOUT terraform: kubectl_manifest.kubero_operator[13]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomemcacheds.application.kubero.dev]
18:40:49.564 STDOUT terraform: kubectl_manifest.kubero_operator[11]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberokafkas.application.kubero.dev]
18:40:49.564 STDOUT terraform: kubectl_manifest.kubero_operator[16]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopipelines.application.kubero.dev]
18:40:49.636 STDOUT terraform: kubectl_manifest.kubero_operator[21]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/serviceaccounts/kubero-operator-controller-manager]
18:40:49.637 STDOUT terraform: kubectl_manifest.kubero_operator[28]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-viewer-role]
18:40:49.688 STDOUT terraform: kubectl_manifest.kubero_operator[47]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/configmaps/kubero-operator-manager-config]
18:40:49.749 STDOUT terraform: kubectl_manifest.kubero_operator[33]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-editor-role]
18:40:49.772 STDOUT terraform: kubectl_manifest.kubero_operator[45]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding]
18:40:49.778 STDOUT terraform: kubectl_manifest.kubero_operator[23]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-admin-role]
18:40:49.783 STDOUT terraform: kubectl_manifest.kubero_operator[32]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-admin-role]
18:40:49.783 STDOUT terraform: kubectl_manifest.kubero_operator[43]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-proxy-role]
18:40:49.850 STDOUT terraform: kubectl_manifest.kubero_operator[30]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-editor-role]
18:40:49.851 STDOUT terraform: helm_release.signoz: Refreshing state... [id=signoz]
18:40:49.898 STDOUT terraform: kubectl_manifest.kubero_operator[14]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomongodbs.application.kubero.dev]
18:40:49.961 STDOUT terraform: kubectl_manifest.kubero_operator[46]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding]
18:40:49.984 STDOUT terraform: kubectl_manifest.kubero_operator[0]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmemcacheds.application.kubero.dev]
18:40:49.991 STDOUT terraform: kubectl_manifest.kubero_operator[44]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system/rolebindings/kubero-operator-leader-election-rolebinding]
18:40:49.997 STDOUT terraform: kubectl_manifest.kubero_operator[42]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-metrics-reader]
18:40:49.998 STDOUT terraform: kubectl_manifest.kubero_operator[15]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomysqls.application.kubero.dev]
18:40:50.061 STDOUT terraform: kubectl_manifest.kubero_operator[24]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-editor-role]
18:40:50.109 STDOUT terraform: kubectl_manifest.kubero_operator[5]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonredis.application.kubero.dev]
18:40:50.169 STDOUT terraform: kubectl_manifest.kubero_operator[34]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-viewer-role]
18:40:50.197 STDOUT terraform: kubectl_manifest.kubero_operator[39]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-editor-role]
18:40:50.209 STDOUT terraform: kubectl_manifest.kubero_operator[9]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoelasticsearches.application.kubero.dev]
18:40:50.214 STDOUT terraform: kubectl_manifest.kubero_operator[22]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system/roles/kubero-operator-leader-election-role]
18:40:50.216 STDOUT terraform: kubectl_manifest.kubero_operator[49]: Refreshing state... [id=/apis/apps/v1/namespaces/kubero-operator-system/deployments/kubero-operator-controller-manager]
18:40:50.270 STDOUT terraform: kubectl_manifest.kubero_operator[26]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-admin-role]
18:40:50.322 STDOUT terraform: kubectl_manifest.kubero_operator[48]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/services/kubero-operator-controller-manager-metrics-service]
18:40:50.378 STDOUT terraform: kubectl_manifest.kubero_operator[25]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-viewer-role]
18:40:50.406 STDOUT terraform: kubectl_manifest.kubero_operator[3]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonpostgres.application.kubero.dev]
18:40:50.419 STDOUT terraform: kubectl_manifest.kubero_operator[12]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomails.application.kubero.dev]
18:40:50.430 STDOUT terraform: kubectl_manifest.kubero_operator[8]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberocouchdbs.application.kubero.dev]
18:40:50.441 STDOUT terraform: kubectl_manifest.kubero_operator[41]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-manager-role]
18:40:50.483 STDOUT terraform: kubectl_manifest.kubero_operator[18]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoprometheuses.application.kubero.dev]
18:40:50.530 STDOUT terraform: kubectl_manifest.kubero_operator[10]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoes.application.kubero.dev]
18:40:50.645 STDOUT terraform: helm_release.casdoor[0]: Refreshing state... [id=casdoor]
18:40:50.650 STDOUT terraform: kubernetes_cluster_role_binding.dashboard_api_admin: Refreshing state... [id=kubernetes-dashboard-api-admin]
18:40:50.658 STDOUT terraform: kubernetes_service_account.dashboard_admin: Refreshing state... [id=platform/dashboard-admin]
18:40:50.659 STDOUT terraform: kubernetes_ingress_v1.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
18:40:50.668 STDOUT terraform: kubernetes_deployment.homer[0]: Refreshing state... [id=platform/homer]
18:40:50.741 STDOUT terraform: kubernetes_namespace.kubero: Refreshing state... [id=kubero]
18:40:51.065 STDOUT terraform: kubernetes_cluster_role_binding.dashboard_admin: Refreshing state... [id=dashboard-admin]
18:40:51.065 STDOUT terraform: kubernetes_secret.dashboard_admin_token: Refreshing state... [id=platform/dashboard-admin-token]
18:40:51.147 STDOUT terraform: kubernetes_service_account.kubero: Refreshing state... [id=kubero/kubero]
18:40:51.159 STDOUT terraform: kubernetes_ingress_v1.homer[0]: Refreshing state... [id=platform/homer-ingress]
18:40:52.009 STDOUT terraform: vault_mount.database: Refreshing state... [id=database]
18:40:52.009 STDOUT terraform: vault_mount.kv: Refreshing state... [id=secret]
18:40:52.009 STDOUT terraform: helm_release.vault_secrets_operator: Refreshing state... [id=vault-secrets-operator]
18:40:52.010 STDOUT terraform: kubernetes_ingress_v1.vault: Refreshing state... [id=platform/vault-ingress]
18:40:52.219 STDOUT terraform: vault_kv_secret_v2.kubero: Refreshing state... [id=secret/data/kubero]
18:40:52.626 STDOUT terraform: data.vault_kv_secret_v2.kubero: Reading...
18:40:52.827 STDOUT terraform: data.vault_kv_secret_v2.kubero: Read complete after 0s [id=secret/data/kubero]
18:40:52.833 STDOUT terraform: kubectl_manifest.kubero_instance: Refreshing state... [id=/apis/application.kubero.dev/v1alpha1/namespaces/kubero/kuberos/kubero]
18:40:52.835 STDOUT terraform: kubernetes_secret.kubero_secrets: Refreshing state... [id=kubero/kubero-secrets]
18:40:54.636 STDOUT terraform: helm_release.portal_auth[0]: Refreshing state... [id=portal-auth]
18:40:54.636 STDOUT terraform: restapi_object.role_vault_viewer[0]: Refreshing state... [id=vault-viewer]
18:40:54.636 STDOUT terraform: restapi_object.role_vault_developer[0]: Refreshing state... [id=vault-developer]
18:40:54.636 STDOUT terraform: restapi_object.provider_github[0]: Refreshing state... [id=GitHub]
18:40:54.636 STDOUT terraform: restapi_object.role_vault_admin[0]: Refreshing state... [id=vault-admin]
18:40:54.897 STDOUT terraform: time_sleep.wait_for_vso_crd: Refreshing state... [id=2025-12-23T10:52:00Z]
18:40:55.693 STDOUT terraform: restapi_object.app_kubero_oidc[0]: Refreshing state... [id=kubero-oidc]
18:40:55.693 STDOUT terraform: restapi_object.app_portal_gate[0]: Refreshing state... [id=portal-gate]
18:40:55.693 STDOUT terraform: restapi_object.app_dashboard_oidc[0]: Refreshing state... [id=dashboard-oidc]
18:40:55.694 STDOUT terraform: restapi_object.app_vault_oidc[0]: Refreshing state... [id=vault-oidc]
18:40:56.120 STDOUT terraform: time_sleep.wait_for_portal_auth[0]: Refreshing state... [id=2025-12-19T09:58:42Z]
18:40:56.128 STDOUT terraform: data.http.portal_auth_ping[0]: Reading...
18:40:56.389 STDOUT terraform: data.http.casdoor_oidc_discovery[0]: Reading...
18:40:57.050 STDOUT terraform: data.http.casdoor_oidc_discovery[0]: Read complete after 1s [id=https://sso.zitian.party/.well-known/openid-configuration]
18:40:57.053 STDOUT terraform: vault_jwt_auth_backend.oidc[0]: Refreshing state... [id=oidc]
18:40:57.263 STDOUT terraform: data.http.portal_auth_ping[0]: Read complete after 1s [id=https://auth.zitian.party/ping]
18:40:57.664 STDOUT terraform: vault_identity_group_alias.admin_builtin[0]: Refreshing state... [id=6197e6bd-4daa-e1d5-940e-24e1c9096ebf]
18:40:57.664 STDOUT terraform: vault_identity_group_alias.developer_simple[0]: Refreshing state... [id=24e3efa8-aeb9-2d0c-8560-ce2059c3d5da]
18:40:57.664 STDOUT terraform: vault_identity_group_alias.developer_builtin[0]: Refreshing state... [id=adbcc54d-1bec-d67d-09c0-709b58552670]
18:40:57.664 STDOUT terraform: vault_identity_group_alias.admin_simple[0]: Refreshing state... [id=c0f961f0-cc0c-3e4d-549e-c976186b4bd7]
18:40:57.665 STDOUT terraform: vault_jwt_auth_backend_role.reader[0]: Refreshing state... [id=auth/oidc/role/reader]
18:40:57.665 STDOUT terraform: vault_identity_group_alias.viewer_simple[0]: Refreshing state... [id=4deefb07-a7ed-2c16-33ba-c1a444480869]
18:40:57.665 STDOUT terraform: vault_jwt_auth_backend_role.default[0]: Refreshing state... [id=auth/oidc/role/default]
18:40:57.666 STDOUT terraform: vault_identity_group_alias.developer_namespaced[0]: Refreshing state... [id=845f51cf-7421-e12a-deb8-168563cb0cf2]
18:40:57.666 STDOUT terraform: vault_identity_group_alias.viewer_namespaced[0]: Refreshing state... [id=1f49ae4f-983f-9c9c-fb25-6bf2e3971d18]
18:40:57.868 STDOUT terraform: vault_identity_group_alias.admin_namespaced[0]: Refreshing state... [id=4f89a529-545d-5208-4ce0-bbfc6f7f81cc]
18:40:59.940 STDOUT terraform: kubernetes_manifest.portal_auth_middleware_platform[0]: Refreshing state...
18:41:00.378 STDOUT terraform: Terraform used the selected providers to generate the following execution
18:41:00.378 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
18:41:00.378 STDOUT terraform:   + create
18:41:00.378 STDOUT terraform: Terraform will perform the following actions:
18:41:00.378 STDOUT terraform:   # vault_identity_group_alias.admin_builtin[0] will be created
18:41:00.378 STDOUT terraform:   + resource "vault_identity_group_alias" "admin_builtin" {
18:41:00.378 STDOUT terraform:       + canonical_id   = "0ac3b38e-52bb-3a86-d72d-71ad31784ee3"
18:41:00.378 STDOUT terraform:       + id             = (known after apply)
18:41:00.378 STDOUT terraform:       + mount_accessor = "auth_oidc_93901082"
18:41:00.378 STDOUT terraform:       + name           = "built-in/vault-admin"
18:41:00.378 STDOUT terraform:     }
18:41:00.379 STDOUT terraform:   # vault_identity_group_alias.admin_namespaced[0] will be created
18:41:00.379 STDOUT terraform:   + resource "vault_identity_group_alias" "admin_namespaced" {
18:41:00.379 STDOUT terraform:       + canonical_id   = "0ac3b38e-52bb-3a86-d72d-71ad31784ee3"
18:41:00.379 STDOUT terraform:       + id             = (known after apply)
18:41:00.379 STDOUT terraform:       + mount_accessor = "auth_oidc_93901082"
18:41:00.379 STDOUT terraform:       + name           = "admin/vault-admin"
18:41:00.379 STDOUT terraform:     }
18:41:00.379 STDOUT terraform:   # vault_identity_group_alias.developer_namespaced[0] will be created
18:41:00.379 STDOUT terraform:   + resource "vault_identity_group_alias" "developer_namespaced" {
18:41:00.379 STDOUT terraform:       + canonical_id   = "f7e4fa30-a522-c524-6927-6e0f8c21d4f3"
18:41:00.379 STDOUT terraform:       + id             = (known after apply)
18:41:00.379 STDOUT terraform:       + mount_accessor = "auth_oidc_93901082"
18:41:00.379 STDOUT terraform:       + name           = "admin/vault-developer"
18:41:00.379 STDOUT terraform:     }
18:41:00.379 STDOUT terraform:   # vault_identity_group_alias.developer_simple[0] will be created
18:41:00.379 STDOUT terraform:   + resource "vault_identity_group_alias" "developer_simple" {
18:41:00.379 STDOUT terraform:       + canonical_id   = "f7e4fa30-a522-c524-6927-6e0f8c21d4f3"
18:41:00.379 STDOUT terraform:       + id             = (known after apply)
18:41:00.379 STDOUT terraform:       + mount_accessor = "auth_oidc_93901082"
18:41:00.379 STDOUT terraform:       + name           = "vault-developer"
18:41:00.379 STDOUT terraform:     }
18:41:00.379 STDOUT terraform:   # vault_identity_group_alias.viewer_namespaced[0] will be created
18:41:00.379 STDOUT terraform:   + resource "vault_identity_group_alias" "viewer_namespaced" {
18:41:00.379 STDOUT terraform:       + canonical_id   = "89e06fbb-fc87-9471-ecc7-04b5747e4b06"
18:41:00.379 STDOUT terraform:       + id             = (known after apply)
18:41:00.380 STDOUT terraform:       + mount_accessor = "auth_oidc_93901082"
18:41:00.380 STDOUT terraform:       + name           = "admin/vault-viewer"
18:41:00.380 STDOUT terraform:     }
18:41:00.380 STDOUT terraform: Plan: 5 to add, 0 to change, 0 to destroy.
18:41:00.380 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
18:41:00.380 STDOUT terraform: Saved the plan to: tfplan
18:41:00.380 STDOUT terraform: To perform exactly these actions, run the following command to apply:
18:41:00.380 STDOUT terraform:     terraform apply "tfplan"
```

### 📦 envs/staging/data

```terraform
18:41:09.584 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
18:41:09.617 WARN   Config ../../../platform/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
18:41:11.809 STDOUT terraform: data.terraform_remote_state.platform: Reading...
18:41:11.812 STDOUT terraform: random_password.openpanel_clickhouse: Refreshing state... [id=none]
18:41:11.812 STDOUT terraform: kubernetes_namespace.data: Refreshing state... [id=data-staging]
18:41:11.815 STDOUT terraform: random_password.clickhouse: Refreshing state... [id=none]
18:41:11.815 STDOUT terraform: random_bytes.arangodb_jwt: Refreshing state...
18:41:11.816 STDOUT terraform: random_password.redis: Refreshing state... [id=none]
18:41:11.817 STDOUT terraform: random_password.arangodb: Refreshing state... [id=none]
18:41:11.818 STDOUT terraform: random_password.openpanel_postgres: Refreshing state... [id=none]
18:41:11.818 STDOUT terraform: random_password.postgres: Refreshing state... [id=none]
18:41:11.818 STDOUT terraform: random_password.signoz_clickhouse: Refreshing state... [id=none]
18:41:12.623 STDOUT terraform: time_sleep.wait_for_vso: Refreshing state... [id=2025-12-25T18:40:33Z]
18:41:12.632 STDOUT terraform: kubectl_manifest.vault_auth: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-staging/vaultauths/default]
18:41:12.829 STDOUT terraform: data.terraform_remote_state.platform: Read complete after 1s
18:41:12.834 STDOUT terraform: vault_kv_secret_v2.clickhouse: Refreshing state... [id=secret/data/clickhouse]
18:41:12.834 STDOUT terraform: vault_kv_secret_v2.arangodb: Refreshing state... [id=secret/data/arangodb]
18:41:12.834 STDOUT terraform: vault_kv_secret_v2.postgres: Refreshing state... [id=secret/data/postgres]
18:41:12.834 STDOUT terraform: vault_kv_secret_v2.redis: Refreshing state... [id=secret/data/redis]
18:41:14.056 STDOUT terraform: kubectl_manifest.arangodb_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-staging/vaultstaticsecrets/arangodb-credentials]
18:41:14.061 STDOUT terraform: kubectl_manifest.postgres_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-staging/vaultstaticsecrets/postgresql-credentials]
18:41:14.065 STDOUT terraform: kubectl_manifest.redis_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-staging/vaultstaticsecrets/redis-credentials]
18:41:14.067 STDOUT terraform: kubectl_manifest.clickhouse_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-staging/vaultstaticsecrets/clickhouse-credentials]
18:41:14.270 STDOUT terraform: time_sleep.wait_for_arangodb_secret: Refreshing state... [id=2025-12-25T18:40:51Z]
18:41:14.364 STDOUT terraform: Terraform used the selected providers to generate the following execution
18:41:14.364 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
18:41:14.364 STDOUT terraform:   + create
18:41:14.364 STDOUT terraform: Terraform will perform the following actions:
18:41:14.364 STDOUT terraform:   # clickhousedbops_database.openpanel_events will be created
18:41:14.364 STDOUT terraform:   + resource "clickhousedbops_database" "openpanel_events" {
18:41:14.364 STDOUT terraform:       + name = "openpanel_events"
18:41:14.365 STDOUT terraform:       + uuid = (known after apply)
18:41:14.365 STDOUT terraform:     }
18:41:14.365 STDOUT terraform:   # clickhousedbops_database.signoz_logs will be created
18:41:14.365 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_logs" {
18:41:14.365 STDOUT terraform:       + name = "signoz_logs"
18:41:14.365 STDOUT terraform:       + uuid = (known after apply)
18:41:14.365 STDOUT terraform:     }
18:41:14.365 STDOUT terraform:   # clickhousedbops_database.signoz_metrics will be created
18:41:14.365 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_metrics" {
18:41:14.365 STDOUT terraform:       + name = "signoz_metrics"
18:41:14.365 STDOUT terraform:       + uuid = (known after apply)
18:41:14.365 STDOUT terraform:     }
18:41:14.365 STDOUT terraform:   # clickhousedbops_database.signoz_traces will be created
18:41:14.365 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_traces" {
18:41:14.365 STDOUT terraform:       + name = "signoz_traces"
18:41:14.365 STDOUT terraform:       + uuid = (known after apply)
18:41:14.365 STDOUT terraform:     }
18:41:14.365 STDOUT terraform:   # clickhousedbops_user.openpanel will be created
18:41:14.365 STDOUT terraform:   + resource "clickhousedbops_user" "openpanel" {
18:41:14.365 STDOUT terraform:       + id                              = (known after apply)
18:41:14.365 STDOUT terraform:       + name                            = "openpanel"
18:41:14.365 STDOUT terraform:       + password_sha256_hash_wo         = (write-only attribute)
18:41:14.365 STDOUT terraform:       + password_sha256_hash_wo_version = 1
18:41:14.365 STDOUT terraform:     }
18:41:14.365 STDOUT terraform:   # clickhousedbops_user.signoz will be created
18:41:14.365 STDOUT terraform:   + resource "clickhousedbops_user" "signoz" {
18:41:14.365 STDOUT terraform:       + id                              = (known after apply)
18:41:14.365 STDOUT terraform:       + name                            = "signoz"
18:41:14.365 STDOUT terraform:       + password_sha256_hash_wo         = (write-only attribute)
18:41:14.366 STDOUT terraform:       + password_sha256_hash_wo_version = 1
18:41:14.366 STDOUT terraform:     }
18:41:14.366 STDOUT terraform:   # helm_release.arangodb_operator will be created
18:41:14.366 STDOUT terraform:   + resource "helm_release" "arangodb_operator" {
18:41:14.366 STDOUT terraform:       + atomic                     = false
18:41:14.366 STDOUT terraform:       + chart                      = "kube-arangodb"
18:41:14.366 STDOUT terraform:       + cleanup_on_fail            = false
18:41:14.366 STDOUT terraform:       + create_namespace           = false
18:41:14.366 STDOUT terraform:       + dependency_update          = false
18:41:14.366 STDOUT terraform:       + disable_crd_hooks          = false
18:41:14.366 STDOUT terraform:       + disable_openapi_validation = false
18:41:14.366 STDOUT terraform:       + disable_webhooks           = false
18:41:14.366 STDOUT terraform:       + force_update               = false
18:41:14.366 STDOUT terraform:       + id                         = (known after apply)
18:41:14.366 STDOUT terraform:       + lint                       = false
18:41:14.366 STDOUT terraform:       + manifest                   = (known after apply)
18:41:14.366 STDOUT terraform:       + max_history                = 0
18:41:14.366 STDOUT terraform:       + metadata                   = (known after apply)
18:41:14.366 STDOUT terraform:       + name                       = "arangodb-operator"
18:41:14.366 STDOUT terraform:       + namespace                  = "data-staging"
18:41:14.366 STDOUT terraform:       + pass_credentials           = false
18:41:14.366 STDOUT terraform:       + recreate_pods              = false
18:41:14.366 STDOUT terraform:       + render_subchart_notes      = true
18:41:14.366 STDOUT terraform:       + replace                    = false
18:41:14.366 STDOUT terraform:       + repository                 = "https://arangodb.github.io/kube-arangodb"
18:41:14.366 STDOUT terraform:       + reset_values               = false
18:41:14.367 STDOUT terraform:       + reuse_values               = false
18:41:14.367 STDOUT terraform:       + skip_crds                  = false
18:41:14.367 STDOUT terraform:       + status                     = "deployed"
18:41:14.367 STDOUT terraform:       + timeout                    = 300
18:41:14.367 STDOUT terraform:       + values                     = [
18:41:14.367 STDOUT terraform:           + <<-EOT
18:41:14.367 STDOUT terraform:                 "operator":
18:41:14.367 STDOUT terraform:                   "replicaCount": 1
18:41:14.367 STDOUT terraform:                   "resources":
18:41:14.367 STDOUT terraform:                     "limits":
18:41:14.367 STDOUT terraform:                       "cpu": "200m"
18:41:14.367 STDOUT terraform:                       "memory": "256Mi"
18:41:14.367 STDOUT terraform:                     "requests":
18:41:14.367 STDOUT terraform:                       "cpu": "50m"
18:41:14.367 STDOUT terraform:                       "memory": "64Mi"
18:41:14.367 STDOUT terraform:             EOT,
18:41:14.367 STDOUT terraform:         ]
18:41:14.367 STDOUT terraform:       + verify                     = false
18:41:14.367 STDOUT terraform:       + version                    = "1.2.43"
18:41:14.367 STDOUT terraform:       + wait                       = true
18:41:14.367 STDOUT terraform:       + wait_for_jobs              = true
18:41:14.367 STDOUT terraform:     }
18:41:14.367 STDOUT terraform:   # helm_release.clickhouse_operator will be created
18:41:14.367 STDOUT terraform:   + resource "helm_release" "clickhouse_operator" {
18:41:14.367 STDOUT terraform:       + atomic                     = false
18:41:14.367 STDOUT terraform:       + chart                      = "altinity-clickhouse-operator"
18:41:14.367 STDOUT terraform:       + cleanup_on_fail            = false
18:41:14.367 STDOUT terraform:       + create_namespace           = false
18:41:14.367 STDOUT terraform:       + dependency_update          = false
18:41:14.367 STDOUT terraform:       + disable_crd_hooks          = false
18:41:14.367 STDOUT terraform:       + disable_openapi_validation = false
18:41:14.367 STDOUT terraform:       + disable_webhooks           = false
18:41:14.368 STDOUT terraform:       + force_update               = false
18:41:14.368 STDOUT terraform:       + id                         = (known after apply)
18:41:14.368 STDOUT terraform:       + lint                       = false
18:41:14.368 STDOUT terraform:       + manifest                   = (known after apply)
18:41:14.368 STDOUT terraform:       + max_history                = 0
18:41:14.368 STDOUT terraform:       + metadata                   = (known after apply)
18:41:14.368 STDOUT terraform:       + name                       = "clickhouse-operator"
18:41:14.368 STDOUT terraform:       + namespace                  = "data-staging"
18:41:14.368 STDOUT terraform:       + pass_credentials           = false
18:41:14.368 STDOUT terraform:       + recreate_pods              = false
18:41:14.368 STDOUT terraform:       + render_subchart_notes      = true
18:41:14.368 STDOUT terraform:       + replace                    = false
18:41:14.368 STDOUT terraform:       + repository                 = "https://altinity.github.io/clickhouse-operator/"
18:41:14.368 STDOUT terraform:       + reset_values               = false
18:41:14.368 STDOUT terraform:       + reuse_values               = false
18:41:14.368 STDOUT terraform:       + skip_crds                  = false
18:41:14.368 STDOUT terraform:       + status                     = "deployed"
18:41:14.368 STDOUT terraform:       + timeout                    = 300
18:41:14.368 STDOUT terraform:       + verify                     = false
18:41:14.368 STDOUT terraform:       + version                    = "0.25.6"
18:41:14.368 STDOUT terraform:       + wait                       = true
18:41:14.368 STDOUT terraform:       + wait_for_jobs              = true
18:41:14.368 STDOUT terraform:     }
18:41:14.368 STDOUT terraform:   # helm_release.redis_operator will be created
18:41:14.368 STDOUT terraform:   + resource "helm_release" "redis_operator" {
18:41:14.368 STDOUT terraform:       + atomic                     = false
18:41:14.368 STDOUT terraform:       + chart                      = "redis-operator"
18:41:14.369 STDOUT terraform:       + cleanup_on_fail            = false
18:41:14.369 STDOUT terraform:       + create_namespace           = false
18:41:14.369 STDOUT terraform:       + dependency_update          = false
18:41:14.369 STDOUT terraform:       + disable_crd_hooks          = false
18:41:14.369 STDOUT terraform:       + disable_openapi_validation = false
18:41:14.369 STDOUT terraform:       + disable_webhooks           = false
18:41:14.369 STDOUT terraform:       + force_update               = false
18:41:14.369 STDOUT terraform:       + id                         = (known after apply)
18:41:14.369 STDOUT terraform:       + lint                       = false
18:41:14.369 STDOUT terraform:       + manifest                   = (known after apply)
18:41:14.369 STDOUT terraform:       + max_history                = 0
18:41:14.369 STDOUT terraform:       + metadata                   = (known after apply)
18:41:14.369 STDOUT terraform:       + name                       = "redis-operator"
18:41:14.369 STDOUT terraform:       + namespace                  = "data-staging"
18:41:14.369 STDOUT terraform:       + pass_credentials           = false
18:41:14.369 STDOUT terraform:       + recreate_pods              = false
18:41:14.369 STDOUT terraform:       + render_subchart_notes      = true
18:41:14.369 STDOUT terraform:       + replace                    = false
18:41:14.369 STDOUT terraform:       + repository                 = "https://ot-container-kit.github.io/helm-charts/"
18:41:14.369 STDOUT terraform:       + reset_values               = false
18:41:14.369 STDOUT terraform:       + reuse_values               = false
18:41:14.369 STDOUT terraform:       + skip_crds                  = false
18:41:14.369 STDOUT terraform:       + status                     = "deployed"
18:41:14.369 STDOUT terraform:       + timeout                    = 300
18:41:14.369 STDOUT terraform:       + verify                     = false
18:41:14.369 STDOUT terraform:       + version                    = "0.6.0"
18:41:14.369 STDOUT terraform:       + wait                       = true
18:41:14.369 STDOUT terraform:       + wait_for_jobs              = true
18:41:14.369 STDOUT terraform:     }
18:41:14.369 STDOUT terraform:   # kubectl_manifest.arangodb_deployment will be created
18:41:14.369 STDOUT terraform:   + resource "kubectl_manifest" "arangodb_deployment" {
18:41:14.369 STDOUT terraform:       + api_version             = "database.arangodb.com/v1"
18:41:14.369 STDOUT terraform:       + apply_only              = false
18:41:14.369 STDOUT terraform:       + field_manager           = "kubectl"
18:41:14.369 STDOUT terraform:       + force_conflicts         = false
18:41:14.369 STDOUT terraform:       + force_new               = false
18:41:14.370 STDOUT terraform:       + id                      = (known after apply)
18:41:14.370 STDOUT terraform:       + kind                    = "ArangoDeployment"
18:41:14.370 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
18:41:14.370 STDOUT terraform:       + live_uid                = (known after apply)
18:41:14.370 STDOUT terraform:       + name                    = "arangodb"
18:41:14.370 STDOUT terraform:       + namespace               = "data-staging"
18:41:14.370 STDOUT terraform:       + server_side_apply       = false
18:41:14.370 STDOUT terraform:       + uid                     = (known after apply)
18:41:14.370 STDOUT terraform:       + validate_schema         = true
18:41:14.370 STDOUT terraform:       + wait_for_rollout        = true
18:41:14.370 STDOUT terraform:       + yaml_body               = (sensitive value)
18:41:14.370 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
18:41:14.370 STDOUT terraform:             apiVersion: database.arangodb.com/v1
18:41:14.370 STDOUT terraform:             kind: ArangoDeployment
18:41:14.370 STDOUT terraform:             metadata:
18:41:14.370 STDOUT terraform:               name: arangodb
18:41:14.370 STDOUT terraform:               namespace: data-staging
18:41:14.370 STDOUT terraform:             spec:
18:41:14.370 STDOUT terraform:               auth:
18:41:14.370 STDOUT terraform:                 jwtSecretName: arangodb-credentials
18:41:14.370 STDOUT terraform:               image: arangodb/arangodb:3.11.8
18:41:14.370 STDOUT terraform:               mode: Single
18:41:14.370 STDOUT terraform:               single:
18:41:14.370 STDOUT terraform:                 count: 1
18:41:14.370 STDOUT terraform:                 resources:
18:41:14.370 STDOUT terraform:                   limits:
18:41:14.370 STDOUT terraform:                     cpu: 500m
18:41:14.370 STDOUT terraform:                     memory: 512Mi
18:41:14.370 STDOUT terraform:                   requests:
18:41:14.370 STDOUT terraform:                     cpu: 100m
18:41:14.370 STDOUT terraform:                     memory: 128Mi
18:41:14.370 STDOUT terraform:                 volumeClaimTemplate:
18:41:14.370 STDOUT terraform:                   spec:
18:41:14.370 STDOUT terraform:                     accessModes:
18:41:14.370 STDOUT terraform:                     - ReadWriteOnce
18:41:14.370 STDOUT terraform:                     resources:
18:41:14.370 STDOUT terraform:                       requests:
18:41:14.370 STDOUT terraform:                         storage: 5Gi
18:41:14.370 STDOUT terraform:                     storageClassName: local-path-retain
18:41:14.370 STDOUT terraform:         EOT
18:41:14.370 STDOUT terraform:       + yaml_incluster          = (sensitive value)
18:41:14.370 STDOUT terraform:     }
18:41:14.370 STDOUT terraform:   # kubectl_manifest.clickhouse_installation will be created
18:41:14.370 STDOUT terraform:   + resource "kubectl_manifest" "clickhouse_installation" {
18:41:14.370 STDOUT terraform:       + api_version             = "clickhouse.altinity.com/v1"
18:41:14.370 STDOUT terraform:       + apply_only              = false
18:41:14.370 STDOUT terraform:       + field_manager           = "kubectl"
18:41:14.370 STDOUT terraform:       + force_conflicts         = false
18:41:14.371 STDOUT terraform:       + force_new               = false
18:41:14.371 STDOUT terraform:       + id                      = (known after apply)
18:41:14.371 STDOUT terraform:       + kind                    = "ClickHouseInstallation"
18:41:14.371 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
18:41:14.371 STDOUT terraform:       + live_uid                = (known after apply)
18:41:14.371 STDOUT terraform:       + name                    = "clickhouse"
18:41:14.371 STDOUT terraform:       + namespace               = "data-staging"
18:41:14.371 STDOUT terraform:       + server_side_apply       = false
18:41:14.371 STDOUT terraform:       + uid                     = (known after apply)
18:41:14.371 STDOUT terraform:       + validate_schema         = true
18:41:14.371 STDOUT terraform:       + wait_for_rollout        = true
18:41:14.371 STDOUT terraform:       + yaml_body               = (sensitive value)
18:41:14.371 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
18:41:14.371 STDOUT terraform:             apiVersion: clickhouse.altinity.com/v1
18:41:14.371 STDOUT terraform:             kind: ClickHouseInstallation
18:41:14.371 STDOUT terraform:             metadata:
18:41:14.371 STDOUT terraform:               labels:
18:41:14.371 STDOUT terraform:                 env: staging
18:41:14.371 STDOUT terraform:                 module: data
18:41:14.371 STDOUT terraform:               name: clickhouse
18:41:14.371 STDOUT terraform:               namespace: data-staging
18:41:14.371 STDOUT terraform:             spec:
18:41:14.371 STDOUT terraform:               configuration:
18:41:14.371 STDOUT terraform:                 clusters:
18:41:14.371 STDOUT terraform:                 - layout:
18:41:14.371 STDOUT terraform:                     replicasCount: 1
18:41:14.371 STDOUT terraform:                     shardsCount: 1
18:41:14.371 STDOUT terraform:                   name: main
18:41:14.371 STDOUT terraform:                 users:
18:41:14.371 STDOUT terraform:                   default/networks/ip:
18:41:14.371 STDOUT terraform:                   - 0.0.0.0/0
18:41:14.371 STDOUT terraform:                   default/password: u8HoT9tzbPmN872jlWgqwwnDVAar3Y7o
18:41:14.371 STDOUT terraform:                   default/password_sha256_hex: 132d51332680fa7a4ac0b31a10a91531828524e85298c4fc697ccd02170bb2d8
18:41:14.371 STDOUT terraform:               defaults:
18:41:14.371 STDOUT terraform:                 templates:
18:41:14.371 STDOUT terraform:                   podTemplate: clickhouse-pod
18:41:14.371 STDOUT terraform:                   serviceTemplate: clickhouse-service
18:41:14.371 STDOUT terraform:               templates:
18:41:14.371 STDOUT terraform:                 podTemplates:
18:41:14.371 STDOUT terraform:                 - name: clickhouse-pod
18:41:14.371 STDOUT terraform:                   spec:
18:41:14.371 STDOUT terraform:                     containers:
18:41:14.371 STDOUT terraform:                     - image: clickhouse/clickhouse-server:25.7.8
18:41:14.371 STDOUT terraform:                       imagePullPolicy: IfNotPresent
18:41:14.372 STDOUT terraform:                       name: clickhouse
18:41:14.372 STDOUT terraform:                       resources:
18:41:14.372 STDOUT terraform:                         limits:
18:41:14.372 STDOUT terraform:                           cpu: 1000m
18:41:14.372 STDOUT terraform:                           memory: 1Gi
18:41:14.372 STDOUT terraform:                         requests:
18:41:14.372 STDOUT terraform:                           cpu: 200m
18:41:14.372 STDOUT terraform:                           memory: 256Mi
18:41:14.372 STDOUT terraform:                       volumeMounts:
18:41:14.372 STDOUT terraform:                       - mountPath: /var/lib/clickhouse
18:41:14.372 STDOUT terraform:                         name: clickhouse-data
18:41:14.372 STDOUT terraform:                 serviceTemplates:
18:41:14.372 STDOUT terraform:                 - metadata:
18:41:14.372 STDOUT terraform:                     name: clickhouse
18:41:14.372 STDOUT terraform:                   name: clickhouse-service
18:41:14.372 STDOUT terraform:                   spec:
18:41:14.372 STDOUT terraform:                     ports:
18:41:14.372 STDOUT terraform:                     - name: http
18:41:14.372 STDOUT terraform:                       port: 8123
18:41:14.372 STDOUT terraform:                     - name: tcp
18:41:14.372 STDOUT terraform:                       port: 9000
18:41:14.372 STDOUT terraform:                     type: ClusterIP
18:41:14.372 STDOUT terraform:                 volumeClaimTemplates:
18:41:14.372 STDOUT terraform:                 - name: clickhouse-data
18:41:14.372 STDOUT terraform:                   spec:
18:41:14.372 STDOUT terraform:                     accessModes:
18:41:14.372 STDOUT terraform:                     - ReadWriteOnce
18:41:14.372 STDOUT terraform:                     resources:
18:41:14.372 STDOUT terraform:                       requests:
18:41:14.372 STDOUT terraform:                         storage: 10Gi
18:41:14.372 STDOUT terraform:                     storageClassName: local-path-retain
18:41:14.372 STDOUT terraform:         EOT
18:41:14.372 STDOUT terraform:       + yaml_incluster          = (sensitive value)
18:41:14.372 STDOUT terraform:     }
18:41:14.372 STDOUT terraform:   # kubectl_manifest.openpanel_postgres_init will be created
18:41:14.372 STDOUT terraform:   + resource "kubectl_manifest" "openpanel_postgres_init" {
18:41:14.372 STDOUT terraform:       + api_version             = "batch/v1"
18:41:14.372 STDOUT terraform:       + apply_only              = false
18:41:14.372 STDOUT terraform:       + field_manager           = "kubectl"
18:41:14.372 STDOUT terraform:       + force_conflicts         = false
18:41:14.372 STDOUT terraform:       + force_new               = false
18:41:14.372 STDOUT terraform:       + id                      = (known after apply)
18:41:14.372 STDOUT terraform:       + kind                    = "Job"
18:41:14.372 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
18:41:14.372 STDOUT terraform:       + live_uid                = (known after apply)
18:41:14.372 STDOUT terraform:       + name                    = "openpanel-postgres-init"
18:41:14.372 STDOUT terraform:       + namespace               = "data-staging"
18:41:14.372 STDOUT terraform:       + server_side_apply       = false
18:41:14.373 STDOUT terraform:       + uid                     = (known after apply)
18:41:14.373 STDOUT terraform:       + validate_schema         = true
18:41:14.373 STDOUT terraform:       + wait_for_rollout        = true
18:41:14.373 STDOUT terraform:       + yaml_body               = (sensitive value)
18:41:14.373 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
18:41:14.373 STDOUT terraform:             apiVersion: batch/v1
18:41:14.373 STDOUT terraform:             kind: Job
18:41:14.373 STDOUT terraform:             metadata:
18:41:14.373 STDOUT terraform:               labels:
18:41:14.373 STDOUT terraform:                 app: openpanel
18:41:14.373 STDOUT terraform:                 purpose: db-init
18:41:14.373 STDOUT terraform:               name: openpanel-postgres-init
18:41:14.373 STDOUT terraform:               namespace: data-staging
18:41:14.373 STDOUT terraform:             spec:
18:41:14.373 STDOUT terraform:               backoffLimit: 3
18:41:14.373 STDOUT terraform:               template:
18:41:14.373 STDOUT terraform:                 spec:
18:41:14.373 STDOUT terraform:                   containers:
18:41:14.373 STDOUT terraform:                   - args:
18:41:14.373 STDOUT terraform:                     - -c
18:41:14.373 STDOUT terraform:                     - |
18:41:14.373 STDOUT terraform:                       set -e
18:41:14.373 STDOUT terraform:                       echo "Waiting for PostgreSQL..."
18:41:14.373 STDOUT terraform:                       until pg_isready -h postgresql-rw -U postgres -t 5; do sleep 2; done
18:41:14.373 STDOUT terraform:             
18:41:14.373 STDOUT terraform:                       echo "Creating OpenPanel user..."
18:41:14.373 STDOUT terraform:                       psql -h postgresql-rw -U postgres -tc "SELECT 1 FROM pg_roles WHERE rolname='openpanel'" | grep -q 1 || \
18:41:14.373 STDOUT terraform:                         psql -h postgresql-rw -U postgres -c "CREATE USER openpanel WITH PASSWORD '$OPENPANEL_PASSWORD';"
18:41:14.373 STDOUT terraform:             
18:41:14.373 STDOUT terraform:                       echo "Creating OpenPanel database..."
18:41:14.373 STDOUT terraform:                       psql -h postgresql-rw -U postgres -tc "SELECT 1 FROM pg_database WHERE datname='openpanel'" | grep -q 1 || \
18:41:14.373 STDOUT terraform:                         psql -h postgresql-rw -U postgres -c "CREATE DATABASE openpanel OWNER openpanel;"
18:41:14.373 STDOUT terraform:             
18:41:14.373 STDOUT terraform:                       echo "OpenPanel PostgreSQL setup complete"
18:41:14.373 STDOUT terraform:                     command:
18:41:14.373 STDOUT terraform:                     - /bin/sh
18:41:14.373 STDOUT terraform:                     env:
18:41:14.373 STDOUT terraform:                     - name: PGPASSWORD
18:41:14.373 STDOUT terraform:                       valueFrom:
18:41:14.373 STDOUT terraform:                         secretKeyRef:
18:41:14.373 STDOUT terraform:                           key: password
18:41:14.373 STDOUT terraform:                           name: postgresql-credentials
18:41:14.373 STDOUT terraform:                     - name: OPENPANEL_PASSWORD
18:41:14.374 STDOUT terraform:                       value: E7xSU49XEbyLh8oS8ZyNPKRG
18:41:14.374 STDOUT terraform:                     image: postgres:16-alpine
18:41:14.374 STDOUT terraform:                     name: psql-init
18:41:14.374 STDOUT terraform:                   restartPolicy: OnFailure
18:41:14.374 STDOUT terraform:               ttlSecondsAfterFinished: 86400
18:41:14.374 STDOUT terraform:         EOT
18:41:14.374 STDOUT terraform:       + yaml_incluster          = (sensitive value)
18:41:14.374 STDOUT terraform:     }
18:41:14.374 STDOUT terraform:   # kubectl_manifest.postgresql_cluster will be created
18:41:14.374 STDOUT terraform:   + resource "kubectl_manifest" "postgresql_cluster" {
18:41:14.374 STDOUT terraform:       + api_version             = "postgresql.cnpg.io/v1"
18:41:14.374 STDOUT terraform:       + apply_only              = false
18:41:14.374 STDOUT terraform:       + field_manager           = "kubectl"
18:41:14.374 STDOUT terraform:       + force_conflicts         = false
18:41:14.374 STDOUT terraform:       + force_new               = false
18:41:14.374 STDOUT terraform:       + id                      = (known after apply)
18:41:14.374 STDOUT terraform:       + kind                    = "Cluster"
18:41:14.374 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
18:41:14.374 STDOUT terraform:       + live_uid                = (known after apply)
18:41:14.374 STDOUT terraform:       + name                    = "postgresql"
18:41:14.374 STDOUT terraform:       + namespace               = "data-staging"
18:41:14.374 STDOUT terraform:       + server_side_apply       = false
18:41:14.374 STDOUT terraform:       + uid                     = (known after apply)
18:41:14.374 STDOUT terraform:       + validate_schema         = true
18:41:14.374 STDOUT terraform:       + wait_for_rollout        = true
18:41:14.374 STDOUT terraform:       + yaml_body               = (sensitive value)
18:41:14.374 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
18:41:14.374 STDOUT terraform:             apiVersion: postgresql.cnpg.io/v1
18:41:14.374 STDOUT terraform:             kind: Cluster
18:41:14.374 STDOUT terraform:             metadata:
18:41:14.374 STDOUT terraform:               labels:
18:41:14.374 STDOUT terraform:                 env: staging
18:41:14.374 STDOUT terraform:                 module: data
18:41:14.374 STDOUT terraform:               name: postgresql
18:41:14.374 STDOUT terraform:               namespace: data-staging
18:41:14.374 STDOUT terraform:             spec:
18:41:14.374 STDOUT terraform:               bootstrap:
18:41:14.374 STDOUT terraform:                 initdb:
18:41:14.374 STDOUT terraform:                   database: app
18:41:14.374 STDOUT terraform:                   owner: postgres
18:41:14.374 STDOUT terraform:               instances: 1
18:41:14.374 STDOUT terraform:               monitoring:
18:41:14.374 STDOUT terraform:                 enablePodMonitor: false
18:41:14.374 STDOUT terraform:               postgresql:
18:41:14.374 STDOUT terraform:                 parameters:
18:41:14.374 STDOUT terraform:                   checkpoint_timeout: 15min
18:41:14.375 STDOUT terraform:                   effective_cache_size: 256MB
18:41:14.375 STDOUT terraform:                   maintenance_work_mem: 64MB
18:41:14.375 STDOUT terraform:                   max_connections: "100"
18:41:14.375 STDOUT terraform:                   max_replication_slots: "3"
18:41:14.375 STDOUT terraform:                   max_wal_senders: "3"
18:41:14.375 STDOUT terraform:                   shared_buffers: 128MB
18:41:14.375 STDOUT terraform:                   wal_level: replica
18:41:14.375 STDOUT terraform:               resources:
18:41:14.375 STDOUT terraform:                 limits:
18:41:14.375 STDOUT terraform:                   cpu: 500m
18:41:14.375 STDOUT terraform:                   memory: 512Mi
18:41:14.375 STDOUT terraform:                 requests:
18:41:14.375 STDOUT terraform:                   cpu: 100m
18:41:14.375 STDOUT terraform:                   memory: 128Mi
18:41:14.375 STDOUT terraform:               storage:
18:41:14.375 STDOUT terraform:                 size: 10Gi
18:41:14.375 STDOUT terraform:                 storageClass: local-path-retain
18:41:14.375 STDOUT terraform:               superuserSecret:
18:41:14.375 STDOUT terraform:                 name: postgresql-credentials
18:41:14.375 STDOUT terraform:         EOT
18:41:14.375 STDOUT terraform:       + yaml_incluster          = (sensitive value)
18:41:14.375 STDOUT terraform:     }
18:41:14.375 STDOUT terraform:   # kubectl_manifest.redis will be created
18:41:14.375 STDOUT terraform:   + resource "kubectl_manifest" "redis" {
18:41:14.375 STDOUT terraform:       + api_version             = "redis.redis.opstreelabs.in/v1beta2"
18:41:14.375 STDOUT terraform:       + apply_only              = false
18:41:14.375 STDOUT terraform:       + field_manager           = "kubectl"
18:41:14.375 STDOUT terraform:       + force_conflicts         = false
18:41:14.375 STDOUT terraform:       + force_new               = false
18:41:14.375 STDOUT terraform:       + id                      = (known after apply)
18:41:14.375 STDOUT terraform:       + kind                    = "Redis"
18:41:14.375 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
18:41:14.375 STDOUT terraform:       + live_uid                = (known after apply)
18:41:14.375 STDOUT terraform:       + name                    = "redis-master"
18:41:14.375 STDOUT terraform:       + namespace               = "data-staging"
18:41:14.375 STDOUT terraform:       + server_side_apply       = false
18:41:14.375 STDOUT terraform:       + uid                     = (known after apply)
18:41:14.375 STDOUT terraform:       + validate_schema         = true
18:41:14.375 STDOUT terraform:       + wait_for_rollout        = true
18:41:14.375 STDOUT terraform:       + yaml_body               = (sensitive value)
18:41:14.375 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
18:41:14.375 STDOUT terraform:             apiVersion: redis.redis.opstreelabs.in/v1beta2
18:41:14.375 STDOUT terraform:             kind: Redis
18:41:14.375 STDOUT terraform:             metadata:
18:41:14.375 STDOUT terraform:               labels:
18:41:14.375 STDOUT terraform:                 env: staging
18:41:14.375 STDOUT terraform:                 module: data
18:41:14.375 STDOUT terraform:               name: redis-master
18:41:14.376 STDOUT terraform:               namespace: data-staging
18:41:14.376 STDOUT terraform:             spec:
18:41:14.376 STDOUT terraform:               kubernetesConfig:
18:41:14.376 STDOUT terraform:                 image: quay.io/opstree/redis:v7.0.15
18:41:14.376 STDOUT terraform:                 imagePullPolicy: IfNotPresent
18:41:14.376 STDOUT terraform:                 redisSecret:
18:41:14.376 STDOUT terraform:                   key: password
18:41:14.376 STDOUT terraform:                   name: redis-credentials
18:41:14.376 STDOUT terraform:                 resources:
18:41:14.376 STDOUT terraform:                   limits:
18:41:14.376 STDOUT terraform:                     cpu: 200m
18:41:14.376 STDOUT terraform:                     memory: 256Mi
18:41:14.376 STDOUT terraform:                   requests:
18:41:14.376 STDOUT terraform:                     cpu: 50m
18:41:14.376 STDOUT terraform:                     memory: 64Mi
18:41:14.376 STDOUT terraform:                 service:
18:41:14.376 STDOUT terraform:                   additional:
18:41:14.376 STDOUT terraform:                     enabled: false
18:41:14.376 STDOUT terraform:               redisConfig:
18:41:14.376 STDOUT terraform:                 additionalRedisConfig: |
18:41:14.376 STDOUT terraform:                   appendonly yes
18:41:14.376 STDOUT terraform:                   appendfsync everysec
18:41:14.376 STDOUT terraform:                   save 900 1
18:41:14.376 STDOUT terraform:                   save 300 10
18:41:14.376 STDOUT terraform:                   save 60 10000
18:41:14.376 STDOUT terraform:               storage:
18:41:14.376 STDOUT terraform:                 keepAfterDelete: true
18:41:14.376 STDOUT terraform:                 volumeClaimTemplate:
18:41:14.376 STDOUT terraform:                   spec:
18:41:14.376 STDOUT terraform:                     accessModes:
18:41:14.376 STDOUT terraform:                     - ReadWriteOnce
18:41:14.376 STDOUT terraform:                     resources:
18:41:14.376 STDOUT terraform:                       requests:
18:41:14.376 STDOUT terraform:                         storage: 2Gi
18:41:14.376 STDOUT terraform:                     storageClassName: local-path-retain
18:41:14.376 STDOUT terraform:         EOT
18:41:14.376 STDOUT terraform:       + yaml_incluster          = (sensitive value)
18:41:14.376 STDOUT terraform:     }
18:41:14.376 STDOUT terraform:   # time_sleep.wait_for_arangodb_crd will be created
18:41:14.376 STDOUT terraform:   + resource "time_sleep" "wait_for_arangodb_crd" {
18:41:14.376 STDOUT terraform:       + create_duration = "30s"
18:41:14.376 STDOUT terraform:       + id              = (known after apply)
18:41:14.376 STDOUT terraform:     }
18:41:14.376 STDOUT terraform:   # time_sleep.wait_for_clickhouse will be created
18:41:14.376 STDOUT terraform:   + resource "time_sleep" "wait_for_clickhouse" {
18:41:14.376 STDOUT terraform:       + create_duration = "30s"
18:41:14.376 STDOUT terraform:       + id              = (known after apply)
18:41:14.376 STDOUT terraform:     }
18:41:14.376 STDOUT terraform:   # time_sleep.wait_for_clickhouse_crd will be created
18:41:14.376 STDOUT terraform:   + resource "time_sleep" "wait_for_clickhouse_crd" {
18:41:14.376 STDOUT terraform:       + create_duration = "30s"
18:41:14.376 STDOUT terraform:       + id              = (known after apply)
18:41:14.376 STDOUT terraform:     }
18:41:14.376 STDOUT terraform:   # time_sleep.wait_for_clickhouse_secret will be created
18:41:14.377 STDOUT terraform:   + resource "time_sleep" "wait_for_clickhouse_secret" {
18:41:14.377 STDOUT terraform:       + create_duration = "15s"
18:41:14.377 STDOUT terraform:       + id              = (known after apply)
18:41:14.377 STDOUT terraform:     }
18:41:14.377 STDOUT terraform:   # time_sleep.wait_for_postgres_secret will be created
18:41:14.377 STDOUT terraform:   + resource "time_sleep" "wait_for_postgres_secret" {
18:41:14.377 STDOUT terraform:       + create_duration = "15s"
18:41:14.377 STDOUT terraform:       + id              = (known after apply)
18:41:14.377 STDOUT terraform:     }
18:41:14.377 STDOUT terraform:   # time_sleep.wait_for_postgresql_cluster will be created
18:41:14.377 STDOUT terraform:   + resource "time_sleep" "wait_for_postgresql_cluster" {
18:41:14.377 STDOUT terraform:       + create_duration = "60s"
18:41:14.377 STDOUT terraform:       + id              = (known after apply)
18:41:14.377 STDOUT terraform:     }
18:41:14.377 STDOUT terraform:   # time_sleep.wait_for_redis_crd will be created
18:41:14.377 STDOUT terraform:   + resource "time_sleep" "wait_for_redis_crd" {
18:41:14.377 STDOUT terraform:       + create_duration = "30s"
18:41:14.377 STDOUT terraform:       + id              = (known after apply)
18:41:14.377 STDOUT terraform:     }
18:41:14.377 STDOUT terraform:   # time_sleep.wait_for_redis_secret will be created
18:41:14.377 STDOUT terraform:   + resource "time_sleep" "wait_for_redis_secret" {
18:41:14.377 STDOUT terraform:       + create_duration = "15s"
18:41:14.377 STDOUT terraform:       + id              = (known after apply)
18:41:14.377 STDOUT terraform:     }
18:41:14.377 STDOUT terraform:   # vault_database_secret_backend_connection.postgres will be created
18:41:14.377 STDOUT terraform:   + resource "vault_database_secret_backend_connection" "postgres" {
18:41:14.377 STDOUT terraform:       + allowed_roles     = [
18:41:14.377 STDOUT terraform:           + "postgres-readonly",
18:41:14.377 STDOUT terraform:           + "postgres-readwrite",
18:41:14.377 STDOUT terraform:         ]
18:41:14.377 STDOUT terraform:       + backend           = "database"
18:41:14.377 STDOUT terraform:       + id                = (known after apply)
18:41:14.377 STDOUT terraform:       + name              = "postgres"
18:41:14.377 STDOUT terraform:       + plugin_name       = (known after apply)
18:41:14.377 STDOUT terraform:       + verify_connection = true
18:41:14.377 STDOUT terraform:       + postgresql {
18:41:14.377 STDOUT terraform:           + connection_url          = (sensitive value)
18:41:14.377 STDOUT terraform:           + max_open_connections    = 2
18:41:14.377 STDOUT terraform:           + password_authentication = "password"
18:41:14.377 STDOUT terraform:         }
18:41:14.377 STDOUT terraform:     }
18:41:14.377 STDOUT terraform:   # vault_database_secret_backend_role.postgres_readonly will be created
18:41:14.377 STDOUT terraform:   + resource "vault_database_secret_backend_role" "postgres_readonly" {
18:41:14.377 STDOUT terraform:       + backend               = "database"
18:41:14.377 STDOUT terraform:       + creation_statements   = [
18:41:14.377 STDOUT terraform:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
18:41:14.378 STDOUT terraform:           + "GRANT SELECT ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
18:41:14.378 STDOUT terraform:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
18:41:14.378 STDOUT terraform:         ]
18:41:14.378 STDOUT terraform:       + credential_type       = (known after apply)
18:41:14.378 STDOUT terraform:       + db_name               = "postgres"
18:41:14.378 STDOUT terraform:       + default_ttl           = 3600
18:41:14.378 STDOUT terraform:       + id                    = (known after apply)
18:41:14.378 STDOUT terraform:       + max_ttl               = 86400
18:41:14.378 STDOUT terraform:       + name                  = "postgres-readonly"
18:41:14.378 STDOUT terraform:       + revocation_statements = [
18:41:14.378 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
18:41:14.378 STDOUT terraform:           + "DROP ROLE IF EXISTS \"{{name}}\";",
18:41:14.378 STDOUT terraform:         ]
18:41:14.378 STDOUT terraform:     }
18:41:14.378 STDOUT terraform:   # vault_database_secret_backend_role.postgres_readwrite will be created
18:41:14.378 STDOUT terraform:   + resource "vault_database_secret_backend_role" "postgres_readwrite" {
18:41:14.378 STDOUT terraform:       + backend               = "database"
18:41:14.378 STDOUT terraform:       + creation_statements   = [
18:41:14.378 STDOUT terraform:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
18:41:14.378 STDOUT terraform:           + "GRANT SELECT, INSERT, UPDATE, DELETE ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
18:41:14.378 STDOUT terraform:           + "GRANT USAGE, SELECT ON ALL SEQUENCES IN SCHEMA public TO \"{{name}}\";",
18:41:14.378 STDOUT terraform:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
18:41:14.378 STDOUT terraform:         ]
18:41:14.378 STDOUT terraform:       + credential_type       = (known after apply)
18:41:14.378 STDOUT terraform:       + db_name               = "postgres"
18:41:14.378 STDOUT terraform:       + default_ttl           = 3600
18:41:14.378 STDOUT terraform:       + id                    = (known after apply)
18:41:14.378 STDOUT terraform:       + max_ttl               = 86400
18:41:14.378 STDOUT terraform:       + name                  = "postgres-readwrite"
18:41:14.378 STDOUT terraform:       + revocation_statements = [
18:41:14.378 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
18:41:14.378 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL SEQUENCES IN SCHEMA public FROM \"{{name}}\";",
18:41:14.378 STDOUT terraform:           + "DROP ROLE IF EXISTS \"{{name}}\";",
18:41:14.378 STDOUT terraform:         ]
18:41:14.378 STDOUT terraform:     }
18:41:14.378 STDOUT terraform:   # vault_kv_secret_v2.openpanel will be created
18:41:14.378 STDOUT terraform:   + resource "vault_kv_secret_v2" "openpanel" {
18:41:14.379 STDOUT terraform:       + data                = (sensitive value)
18:41:14.379 STDOUT terraform:       + data_json           = (sensitive value)
18:41:14.379 STDOUT terraform:       + delete_all_versions = true
18:41:14.379 STDOUT terraform:       + disable_read        = false
18:41:14.379 STDOUT terraform:       + id                  = (known after apply)
18:41:14.379 STDOUT terraform:       + metadata            = (known after apply)
18:41:14.379 STDOUT terraform:       + mount               = "secret"
18:41:14.379 STDOUT terraform:       + name                = "openpanel"
18:41:14.379 STDOUT terraform:       + path                = (known after apply)
18:41:14.379 STDOUT terraform:       + custom_metadata (known after apply)
18:41:14.379 STDOUT terraform:     }
18:41:14.379 STDOUT terraform:   # vault_kv_secret_v2.signoz will be created
18:41:14.379 STDOUT terraform:   + resource "vault_kv_secret_v2" "signoz" {
18:41:14.379 STDOUT terraform:       + data                = (sensitive value)
18:41:14.379 STDOUT terraform:       + data_json           = (sensitive value)
18:41:14.379 STDOUT terraform:       + delete_all_versions = true
18:41:14.379 STDOUT terraform:       + disable_read        = false
18:41:14.379 STDOUT terraform:       + id                  = (known after apply)
18:41:14.379 STDOUT terraform:       + metadata            = (known after apply)
18:41:14.379 STDOUT terraform:       + mount               = "secret"
18:41:14.379 STDOUT terraform:       + name                = "signoz"
18:41:14.379 STDOUT terraform:       + path                = (known after apply)
18:41:14.379 STDOUT terraform:       + custom_metadata (known after apply)
18:41:14.379 STDOUT terraform:     }
18:41:14.379 STDOUT terraform: Plan: 27 to add, 0 to change, 0 to destroy.
18:41:14.379 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
18:41:14.379 STDOUT terraform: Saved the plan to: tfplan
18:41:14.379 STDOUT terraform: To perform exactly these actions, run the following command to apply:
18:41:14.379 STDOUT terraform:     terraform apply "tfplan"
```

### 📦 envs/prod/data

```terraform
18:41:21.180 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
18:41:21.210 WARN   Config ../../../platform/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
18:41:23.465 STDOUT terraform: data.terraform_remote_state.platform: Reading...
18:41:23.471 STDOUT terraform: kubernetes_namespace.data: Refreshing state... [id=data-prod]
18:41:23.473 STDOUT terraform: helm_release.clickhouse: Refreshing state... [id=clickhouse]
18:41:23.474 STDOUT terraform: random_bytes.arangodb_jwt: Refreshing state...
18:41:23.474 STDOUT terraform: random_password.redis: Refreshing state... [id=none]
18:41:23.475 STDOUT terraform: random_password.clickhouse: Refreshing state... [id=none]
18:41:23.475 STDOUT terraform: random_password.arangodb: Refreshing state... [id=none]
18:41:23.476 STDOUT terraform: random_password.openpanel_postgres: Refreshing state... [id=none]
18:41:23.476 STDOUT terraform: random_password.openpanel_clickhouse: Refreshing state... [id=none]
18:41:23.478 STDOUT terraform: random_password.signoz_clickhouse: Refreshing state... [id=none]
18:41:23.496 STDOUT terraform: helm_release.postgresql: Refreshing state... [id=postgresql]
18:41:23.507 STDOUT terraform: random_password.postgres: Refreshing state... [id=none]
18:41:23.508 STDOUT terraform: helm_release.redis: Refreshing state... [id=redis]
18:41:24.284 STDOUT terraform: time_sleep.wait_for_vso: Refreshing state... [id=2025-12-23T17:36:28Z]
18:41:24.285 STDOUT terraform: helm_release.arangodb_operator: Refreshing state... [id=arangodb-operator]
18:41:24.294 STDOUT terraform: kubectl_manifest.vault_auth: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-prod/vaultauths/default]
18:41:24.496 STDOUT terraform: data.terraform_remote_state.platform: Read complete after 1s
18:41:24.499 STDOUT terraform: vault_kv_secret_v2.redis: Refreshing state... [id=secret/data/redis]
18:41:24.499 STDOUT terraform: vault_kv_secret_v2.arangodb: Refreshing state... [id=secret/data/arangodb]
18:41:24.500 STDOUT terraform: vault_kv_secret_v2.clickhouse: Refreshing state... [id=secret/data/clickhouse]
18:41:24.500 STDOUT terraform: vault_kv_secret_v2.postgres: Refreshing state... [id=secret/data/postgres]
18:41:25.884 STDOUT terraform: kubectl_manifest.postgres_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-prod/vaultstaticsecrets/postgresql-credentials]
18:41:25.892 STDOUT terraform: kubectl_manifest.redis_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-prod/vaultstaticsecrets/redis-credentials]
18:41:25.893 STDOUT terraform: kubectl_manifest.clickhouse_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-prod/vaultstaticsecrets/clickhouse-credentials]
18:41:25.893 STDOUT terraform: kubectl_manifest.arangodb_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-prod/vaultstaticsecrets/arangodb-credentials]
18:41:26.096 STDOUT terraform: time_sleep.wait_for_postgres_secret: Refreshing state... [id=2025-12-23T17:36:44Z]
18:41:26.108 STDOUT terraform: time_sleep.wait_for_redis_secret: Refreshing state... [id=2025-12-23T17:36:44Z]
18:41:26.117 STDOUT terraform: kubectl_manifest.openpanel_postgres_init: Refreshing state... [id=/apis/batch/v1/namespaces/data-prod/jobs/openpanel-postgres-init]
18:41:26.131 STDOUT terraform: time_sleep.wait_for_clickhouse_secret: Refreshing state... [id=2025-12-23T17:36:44Z]
18:41:26.134 STDOUT terraform: time_sleep.wait_for_arangodb_secret: Refreshing state... [id=2025-12-23T17:36:44Z]
18:41:26.137 STDOUT terraform: vault_kv_secret_v2.openpanel: Refreshing state... [id=secret/data/openpanel]
18:41:26.143 STDOUT terraform: time_sleep.wait_for_clickhouse: Refreshing state... [id=2025-12-23T03:02:26Z]
18:41:26.150 STDOUT terraform: vault_kv_secret_v2.signoz: Refreshing state... [id=secret/data/signoz]
18:41:26.791 STDOUT terraform: time_sleep.wait_for_arangodb_crd: Refreshing state... [id=2025-12-23T03:02:50Z]
18:41:26.798 STDOUT terraform: kubectl_manifest.arangodb_deployment: Refreshing state... [id=/apis/database.arangodb.com/v1/namespaces/data-prod/arangodeployments/arangodb]
18:41:27.115 STDOUT terraform: Terraform used the selected providers to generate the following execution
18:41:27.115 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
18:41:27.115 STDOUT terraform:   + create
18:41:27.115 STDOUT terraform:   ~ update in-place
18:41:27.115 STDOUT terraform: Terraform will perform the following actions:
18:41:27.115 STDOUT terraform:   # clickhousedbops_database.openpanel_events will be created
18:41:27.115 STDOUT terraform:   + resource "clickhousedbops_database" "openpanel_events" {
18:41:27.115 STDOUT terraform:       + name = "openpanel_events"
18:41:27.115 STDOUT terraform:       + uuid = (known after apply)
18:41:27.115 STDOUT terraform:     }
18:41:27.115 STDOUT terraform:   # clickhousedbops_database.signoz_logs will be created
18:41:27.115 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_logs" {
18:41:27.116 STDOUT terraform:       + name = "signoz_logs"
18:41:27.116 STDOUT terraform:       + uuid = (known after apply)
18:41:27.116 STDOUT terraform:     }
18:41:27.116 STDOUT terraform:   # clickhousedbops_database.signoz_metrics will be created
18:41:27.116 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_metrics" {
18:41:27.116 STDOUT terraform:       + name = "signoz_metrics"
18:41:27.116 STDOUT terraform:       + uuid = (known after apply)
18:41:27.116 STDOUT terraform:     }
18:41:27.116 STDOUT terraform:   # clickhousedbops_database.signoz_traces will be created
18:41:27.116 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_traces" {
18:41:27.116 STDOUT terraform:       + name = "signoz_traces"
18:41:27.116 STDOUT terraform:       + uuid = (known after apply)
18:41:27.116 STDOUT terraform:     }
18:41:27.116 STDOUT terraform:   # clickhousedbops_user.openpanel will be created
18:41:27.116 STDOUT terraform:   + resource "clickhousedbops_user" "openpanel" {
18:41:27.116 STDOUT terraform:       + id                              = (known after apply)
18:41:27.116 STDOUT terraform:       + name                            = "openpanel"
18:41:27.116 STDOUT terraform:       + password_sha256_hash_wo         = (write-only attribute)
18:41:27.116 STDOUT terraform:       + password_sha256_hash_wo_version = 1
18:41:27.116 STDOUT terraform:     }
18:41:27.116 STDOUT terraform:   # clickhousedbops_user.signoz will be created
18:41:27.116 STDOUT terraform:   + resource "clickhousedbops_user" "signoz" {
18:41:27.116 STDOUT terraform:       + id                              = (known after apply)
18:41:27.116 STDOUT terraform:       + name                            = "signoz"
18:41:27.116 STDOUT terraform:       + password_sha256_hash_wo         = (write-only attribute)
18:41:27.116 STDOUT terraform:       + password_sha256_hash_wo_version = 1
18:41:27.116 STDOUT terraform:     }
18:41:27.116 STDOUT terraform:   # helm_release.clickhouse_operator will be created
18:41:27.117 STDOUT terraform:   + resource "helm_release" "clickhouse_operator" {
18:41:27.117 STDOUT terraform:       + atomic                     = false
18:41:27.117 STDOUT terraform:       + chart                      = "altinity-clickhouse-operator"
18:41:27.117 STDOUT terraform:       + cleanup_on_fail            = false
18:41:27.117 STDOUT terraform:       + create_namespace           = false
18:41:27.117 STDOUT terraform:       + dependency_update          = false
18:41:27.117 STDOUT terraform:       + disable_crd_hooks          = false
18:41:27.117 STDOUT terraform:       + disable_openapi_validation = false
18:41:27.117 STDOUT terraform:       + disable_webhooks           = false
18:41:27.117 STDOUT terraform:       + force_update               = false
18:41:27.117 STDOUT terraform:       + id                         = (known after apply)
18:41:27.117 STDOUT terraform:       + lint                       = false
18:41:27.117 STDOUT terraform:       + manifest                   = (known after apply)
18:41:27.117 STDOUT terraform:       + max_history                = 0
18:41:27.117 STDOUT terraform:       + metadata                   = (known after apply)
18:41:27.117 STDOUT terraform:       + name                       = "clickhouse-operator"
18:41:27.117 STDOUT terraform:       + namespace                  = "data-prod"
18:41:27.117 STDOUT terraform:       + pass_credentials           = false
18:41:27.117 STDOUT terraform:       + recreate_pods              = false
18:41:27.117 STDOUT terraform:       + render_subchart_notes      = true
18:41:27.117 STDOUT terraform:       + replace                    = false
18:41:27.117 STDOUT terraform:       + repository                 = "https://altinity.github.io/clickhouse-operator/"
18:41:27.117 STDOUT terraform:       + reset_values               = false
18:41:27.117 STDOUT terraform:       + reuse_values               = false
18:41:27.117 STDOUT terraform:       + skip_crds                  = false
18:41:27.117 STDOUT terraform:       + status                     = "deployed"
18:41:27.117 STDOUT terraform:       + timeout                    = 300
18:41:27.117 STDOUT terraform:       + verify                     = false
18:41:27.117 STDOUT terraform:       + version                    = "0.25.6"
18:41:27.117 STDOUT terraform:       + wait                       = true
18:41:27.117 STDOUT terraform:       + wait_for_jobs              = true
18:41:27.118 STDOUT terraform:     }
18:41:27.118 STDOUT terraform:   # helm_release.redis_operator will be created
18:41:27.118 STDOUT terraform:   + resource "helm_release" "redis_operator" {
18:41:27.118 STDOUT terraform:       + atomic                     = false
18:41:27.118 STDOUT terraform:       + chart                      = "redis-operator"
18:41:27.118 STDOUT terraform:       + cleanup_on_fail            = false
18:41:27.118 STDOUT terraform:       + create_namespace           = false
18:41:27.118 STDOUT terraform:       + dependency_update          = false
18:41:27.118 STDOUT terraform:       + disable_crd_hooks          = false
18:41:27.118 STDOUT terraform:       + disable_openapi_validation = false
18:41:27.118 STDOUT terraform:       + disable_webhooks           = false
18:41:27.118 STDOUT terraform:       + force_update               = false
18:41:27.118 STDOUT terraform:       + id                         = (known after apply)
18:41:27.118 STDOUT terraform:       + lint                       = false
18:41:27.118 STDOUT terraform:       + manifest                   = (known after apply)
18:41:27.118 STDOUT terraform:       + max_history                = 0
18:41:27.118 STDOUT terraform:       + metadata                   = (known after apply)
18:41:27.118 STDOUT terraform:       + name                       = "redis-operator"
18:41:27.118 STDOUT terraform:       + namespace                  = "data-prod"
18:41:27.118 STDOUT terraform:       + pass_credentials           = false
18:41:27.118 STDOUT terraform:       + recreate_pods              = false
18:41:27.118 STDOUT terraform:       + render_subchart_notes      = true
18:41:27.118 STDOUT terraform:       + replace                    = false
18:41:27.118 STDOUT terraform:       + repository                 = "https://ot-container-kit.github.io/helm-charts/"
18:41:27.118 STDOUT terraform:       + reset_values               = false
18:41:27.118 STDOUT terraform:       + reuse_values               = false
18:41:27.118 STDOUT terraform:       + skip_crds                  = false
18:41:27.118 STDOUT terraform:       + status                     = "deployed"
18:41:27.118 STDOUT terraform:       + timeout                    = 300
18:41:27.118 STDOUT terraform:       + verify                     = false
18:41:27.118 STDOUT terraform:       + version                    = "0.6.0"
18:41:27.118 STDOUT terraform:       + wait                       = true
18:41:27.119 STDOUT terraform:       + wait_for_jobs              = true
18:41:27.119 STDOUT terraform:     }
18:41:27.119 STDOUT terraform:   # kubectl_manifest.clickhouse_installation will be created
18:41:27.119 STDOUT terraform:   + resource "kubectl_manifest" "clickhouse_installation" {
18:41:27.119 STDOUT terraform:       + api_version             = "clickhouse.altinity.com/v1"
18:41:27.119 STDOUT terraform:       + apply_only              = false
18:41:27.119 STDOUT terraform:       + field_manager           = "kubectl"
18:41:27.119 STDOUT terraform:       + force_conflicts         = false
18:41:27.119 STDOUT terraform:       + force_new               = false
18:41:27.119 STDOUT terraform:       + id                      = (known after apply)
18:41:27.119 STDOUT terraform:       + kind                    = "ClickHouseInstallation"
18:41:27.119 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
18:41:27.119 STDOUT terraform:       + live_uid                = (known after apply)
18:41:27.119 STDOUT terraform:       + name                    = "clickhouse"
18:41:27.119 STDOUT terraform:       + namespace               = "data-prod"
18:41:27.119 STDOUT terraform:       + server_side_apply       = false
18:41:27.119 STDOUT terraform:       + uid                     = (known after apply)
18:41:27.119 STDOUT terraform:       + validate_schema         = true
18:41:27.119 STDOUT terraform:       + wait_for_rollout        = true
18:41:27.119 STDOUT terraform:       + yaml_body               = (sensitive value)
18:41:27.119 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
18:41:27.119 STDOUT terraform:             apiVersion: clickhouse.altinity.com/v1
18:41:27.119 STDOUT terraform:             kind: ClickHouseInstallation
18:41:27.119 STDOUT terraform:             metadata:
18:41:27.119 STDOUT terraform:               labels:
18:41:27.119 STDOUT terraform:                 env: prod
18:41:27.119 STDOUT terraform:                 module: data
18:41:27.119 STDOUT terraform:               name: clickhouse
18:41:27.119 STDOUT terraform:               namespace: data-prod
18:41:27.119 STDOUT terraform:             spec:
18:41:27.119 STDOUT terraform:               configuration:
18:41:27.119 STDOUT terraform:                 clusters:
18:41:27.119 STDOUT terraform:                 - layout:
18:41:27.119 STDOUT terraform:                     replicasCount: 1
18:41:27.119 STDOUT terraform:                     shardsCount: 1
18:41:27.119 STDOUT terraform:                   name: main
18:41:27.119 STDOUT terraform:                 users:
18:41:27.119 STDOUT terraform:                   default/networks/ip:
18:41:27.119 STDOUT terraform:                   - 0.0.0.0/0
18:41:27.119 STDOUT terraform:                   default/password: 6vnt8XQGdUVrMEiLLtgtrhyJEV754m0r
18:41:27.120 STDOUT terraform:                   default/password_sha256_hex: ba0137951758d5142fb160bc63a151c3a8ec813c7faa62a7dbe881a56734aaee
18:41:27.120 STDOUT terraform:               defaults:
18:41:27.120 STDOUT terraform:                 templates:
18:41:27.120 STDOUT terraform:                   podTemplate: clickhouse-pod
18:41:27.120 STDOUT terraform:                   serviceTemplate: clickhouse-service
18:41:27.120 STDOUT terraform:               templates:
18:41:27.120 STDOUT terraform:                 podTemplates:
18:41:27.120 STDOUT terraform:                 - name: clickhouse-pod
18:41:27.120 STDOUT terraform:                   spec:
18:41:27.120 STDOUT terraform:                     containers:
18:41:27.120 STDOUT terraform:                     - image: clickhouse/clickhouse-server:25.7.8
18:41:27.120 STDOUT terraform:                       imagePullPolicy: IfNotPresent
18:41:27.120 STDOUT terraform:                       name: clickhouse
18:41:27.120 STDOUT terraform:                       resources:
18:41:27.120 STDOUT terraform:                         limits:
18:41:27.120 STDOUT terraform:                           cpu: 1000m
18:41:27.120 STDOUT terraform:                           memory: 1Gi
18:41:27.120 STDOUT terraform:                         requests:
18:41:27.120 STDOUT terraform:                           cpu: 200m
18:41:27.120 STDOUT terraform:                           memory: 256Mi
18:41:27.120 STDOUT terraform:                       volumeMounts:
18:41:27.120 STDOUT terraform:                       - mountPath: /var/lib/clickhouse
18:41:27.120 STDOUT terraform:                         name: clickhouse-data
18:41:27.120 STDOUT terraform:                 serviceTemplates:
18:41:27.120 STDOUT terraform:                 - metadata:
18:41:27.120 STDOUT terraform:                     name: clickhouse
18:41:27.120 STDOUT terraform:                   name: clickhouse-service
18:41:27.120 STDOUT terraform:                   spec:
18:41:27.120 STDOUT terraform:                     ports:
18:41:27.120 STDOUT terraform:                     - name: http
18:41:27.120 STDOUT terraform:                       port: 8123
18:41:27.120 STDOUT terraform:                     - name: tcp
18:41:27.120 STDOUT terraform:                       port: 9000
18:41:27.120 STDOUT terraform:                     type: ClusterIP
18:41:27.120 STDOUT terraform:                 volumeClaimTemplates:
18:41:27.120 STDOUT terraform:                 - name: clickhouse-data
18:41:27.120 STDOUT terraform:                   spec:
18:41:27.121 STDOUT terraform:                     accessModes:
18:41:27.121 STDOUT terraform:                     - ReadWriteOnce
18:41:27.121 STDOUT terraform:                     resources:
18:41:27.121 STDOUT terraform:                       requests:
18:41:27.121 STDOUT terraform:                         storage: 10Gi
18:41:27.121 STDOUT terraform:                     storageClassName: local-path-retain
18:41:27.121 STDOUT terraform:         EOT
18:41:27.121 STDOUT terraform:       + yaml_incluster          = (sensitive value)
18:41:27.121 STDOUT terraform:     }
18:41:27.121 STDOUT terraform:   # kubectl_manifest.openpanel_postgres_init will be created
18:41:27.121 STDOUT terraform:   + resource "kubectl_manifest" "openpanel_postgres_init" {
18:41:27.121 STDOUT terraform:       + api_version             = "batch/v1"
18:41:27.121 STDOUT terraform:       + apply_only              = false
18:41:27.121 STDOUT terraform:       + field_manager           = "kubectl"
18:41:27.121 STDOUT terraform:       + force_conflicts         = false
18:41:27.121 STDOUT terraform:       + force_new               = false
18:41:27.121 STDOUT terraform:       + id                      = (known after apply)
18:41:27.121 STDOUT terraform:       + kind                    = "Job"
18:41:27.121 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
18:41:27.121 STDOUT terraform:       + live_uid                = (known after apply)
18:41:27.121 STDOUT terraform:       + name                    = "openpanel-postgres-init"
18:41:27.121 STDOUT terraform:       + namespace               = "data-prod"
18:41:27.121 STDOUT terraform:       + server_side_apply       = false
18:41:27.121 STDOUT terraform:       + uid                     = (known after apply)
18:41:27.121 STDOUT terraform:       + validate_schema         = true
18:41:27.121 STDOUT terraform:       + wait_for_rollout        = true
18:41:27.121 STDOUT terraform:       + yaml_body               = (sensitive value)
18:41:27.121 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
18:41:27.122 STDOUT terraform:             apiVersion: batch/v1
18:41:27.122 STDOUT terraform:             kind: Job
18:41:27.122 STDOUT terraform:             metadata:
18:41:27.122 STDOUT terraform:               labels:
18:41:27.122 STDOUT terraform:                 app: openpanel
18:41:27.122 STDOUT terraform:                 purpose: db-init
18:41:27.122 STDOUT terraform:               name: openpanel-postgres-init
18:41:27.122 STDOUT terraform:               namespace: data-prod
18:41:27.122 STDOUT terraform:             spec:
18:41:27.122 STDOUT terraform:               backoffLimit: 3
18:41:27.122 STDOUT terraform:               template:
18:41:27.122 STDOUT terraform:                 spec:
18:41:27.122 STDOUT terraform:                   containers:
18:41:27.122 STDOUT terraform:                   - args:
18:41:27.122 STDOUT terraform:                     - -c
18:41:27.122 STDOUT terraform:                     - |
18:41:27.122 STDOUT terraform:                       set -e
18:41:27.122 STDOUT terraform:                       echo "Waiting for PostgreSQL..."
18:41:27.122 STDOUT terraform:                       until pg_isready -h postgresql-rw -U postgres -t 5; do sleep 2; done
18:41:27.122 STDOUT terraform:             
18:41:27.122 STDOUT terraform:                       echo "Creating OpenPanel user..."
18:41:27.122 STDOUT terraform:                       psql -h postgresql-rw -U postgres -tc "SELECT 1 FROM pg_roles WHERE rolname='openpanel'" | grep -q 1 || \
18:41:27.122 STDOUT terraform:                         psql -h postgresql-rw -U postgres -c "CREATE USER openpanel WITH PASSWORD '$OPENPANEL_PASSWORD';"
18:41:27.122 STDOUT terraform:             
18:41:27.122 STDOUT terraform:                       echo "Creating OpenPanel database..."
18:41:27.122 STDOUT terraform:                       psql -h postgresql-rw -U postgres -tc "SELECT 1 FROM pg_database WHERE datname='openpanel'" | grep -q 1 || \
18:41:27.122 STDOUT terraform:                         psql -h postgresql-rw -U postgres -c "CREATE DATABASE openpanel OWNER openpanel;"
18:41:27.122 STDOUT terraform:             
18:41:27.122 STDOUT terraform:                       echo "OpenPanel PostgreSQL setup complete"
18:41:27.123 STDOUT terraform:                     command:
18:41:27.123 STDOUT terraform:                     - /bin/sh
18:41:27.123 STDOUT terraform:                     env:
18:41:27.123 STDOUT terraform:                     - name: PGPASSWORD
18:41:27.123 STDOUT terraform:                       valueFrom:
18:41:27.123 STDOUT terraform:                         secretKeyRef:
18:41:27.123 STDOUT terraform:                           key: password
18:41:27.123 STDOUT terraform:                           name: postgresql-credentials
18:41:27.123 STDOUT terraform:                     - name: OPENPANEL_PASSWORD
18:41:27.123 STDOUT terraform:                       value: FdxydwAOhPbBvygEMXHhf1R9
18:41:27.123 STDOUT terraform:                     image: postgres:16-alpine
18:41:27.123 STDOUT terraform:                     name: psql-init
18:41:27.123 STDOUT terraform:                   restartPolicy: OnFailure
18:41:27.123 STDOUT terraform:               ttlSecondsAfterFinished: 86400
18:41:27.123 STDOUT terraform:         EOT
18:41:27.123 STDOUT terraform:       + yaml_incluster          = (sensitive value)
18:41:27.123 STDOUT terraform:     }
18:41:27.123 STDOUT terraform:   # kubectl_manifest.postgresql_cluster will be created
18:41:27.123 STDOUT terraform:   + resource "kubectl_manifest" "postgresql_cluster" {
18:41:27.123 STDOUT terraform:       + api_version             = "postgresql.cnpg.io/v1"
18:41:27.123 STDOUT terraform:       + apply_only              = false
18:41:27.123 STDOUT terraform:       + field_manager           = "kubectl"
18:41:27.123 STDOUT terraform:       + force_conflicts         = false
18:41:27.123 STDOUT terraform:       + force_new               = false
18:41:27.123 STDOUT terraform:       + id                      = (known after apply)
18:41:27.123 STDOUT terraform:       + kind                    = "Cluster"
18:41:27.123 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
18:41:27.123 STDOUT terraform:       + live_uid                = (known after apply)
18:41:27.123 STDOUT terraform:       + name                    = "postgresql"
18:41:27.124 STDOUT terraform:       + namespace               = "data-prod"
18:41:27.124 STDOUT terraform:       + server_side_apply       = false
18:41:27.124 STDOUT terraform:       + uid                     = (known after apply)
18:41:27.124 STDOUT terraform:       + validate_schema         = true
18:41:27.124 STDOUT terraform:       + wait_for_rollout        = true
18:41:27.124 STDOUT terraform:       + yaml_body               = (sensitive value)
18:41:27.124 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
18:41:27.124 STDOUT terraform:             apiVersion: postgresql.cnpg.io/v1
18:41:27.124 STDOUT terraform:             kind: Cluster
18:41:27.124 STDOUT terraform:             metadata:
18:41:27.124 STDOUT terraform:               labels:
18:41:27.124 STDOUT terraform:                 env: prod
18:41:27.124 STDOUT terraform:                 module: data
18:41:27.124 STDOUT terraform:               name: postgresql
18:41:27.124 STDOUT terraform:               namespace: data-prod
18:41:27.124 STDOUT terraform:             spec:
18:41:27.124 STDOUT terraform:               bootstrap:
18:41:27.124 STDOUT terraform:                 initdb:
18:41:27.124 STDOUT terraform:                   database: app
18:41:27.124 STDOUT terraform:                   owner: postgres
18:41:27.124 STDOUT terraform:               instances: 1
18:41:27.124 STDOUT terraform:               monitoring:
18:41:27.124 STDOUT terraform:                 enablePodMonitor: false
18:41:27.124 STDOUT terraform:               postgresql:
18:41:27.124 STDOUT terraform:                 parameters:
18:41:27.124 STDOUT terraform:                   checkpoint_timeout: 15min
18:41:27.124 STDOUT terraform:                   effective_cache_size: 256MB
18:41:27.124 STDOUT terraform:                   maintenance_work_mem: 64MB
18:41:27.124 STDOUT terraform:                   max_connections: "100"
18:41:27.124 STDOUT terraform:                   max_replication_slots: "3"
18:41:27.124 STDOUT terraform:                   max_wal_senders: "3"
18:41:27.124 STDOUT terraform:                   shared_buffers: 128MB
18:41:27.125 STDOUT terraform:                   wal_level: replica
18:41:27.125 STDOUT terraform:               resources:
18:41:27.125 STDOUT terraform:                 limits:
18:41:27.125 STDOUT terraform:                   cpu: 500m
18:41:27.125 STDOUT terraform:                   memory: 512Mi
18:41:27.125 STDOUT terraform:                 requests:
18:41:27.125 STDOUT terraform:                   cpu: 100m
18:41:27.125 STDOUT terraform:                   memory: 128Mi
18:41:27.125 STDOUT terraform:               storage:
18:41:27.125 STDOUT terraform:                 size: 10Gi
18:41:27.125 STDOUT terraform:                 storageClass: local-path-retain
18:41:27.125 STDOUT terraform:               superuserSecret:
18:41:27.125 STDOUT terraform:                 name: postgresql-credentials
18:41:27.125 STDOUT terraform:         EOT
18:41:27.125 STDOUT terraform:       + yaml_incluster          = (sensitive value)
18:41:27.125 STDOUT terraform:     }
18:41:27.125 STDOUT terraform:   # kubectl_manifest.redis will be created
18:41:27.125 STDOUT terraform:   + resource "kubectl_manifest" "redis" {
18:41:27.125 STDOUT terraform:       + api_version             = "redis.redis.opstreelabs.in/v1beta2"
18:41:27.125 STDOUT terraform:       + apply_only              = false
18:41:27.125 STDOUT terraform:       + field_manager           = "kubectl"
18:41:27.125 STDOUT terraform:       + force_conflicts         = false
18:41:27.125 STDOUT terraform:       + force_new               = false
18:41:27.125 STDOUT terraform:       + id                      = (known after apply)
18:41:27.125 STDOUT terraform:       + kind                    = "Redis"
18:41:27.125 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
18:41:27.125 STDOUT terraform:       + live_uid                = (known after apply)
18:41:27.125 STDOUT terraform:       + name                    = "redis-master"
18:41:27.125 STDOUT terraform:       + namespace               = "data-prod"
18:41:27.126 STDOUT terraform:       + server_side_apply       = false
18:41:27.126 STDOUT terraform:       + uid                     = (known after apply)
18:41:27.126 STDOUT terraform:       + validate_schema         = true
18:41:27.126 STDOUT terraform:       + wait_for_rollout        = true
18:41:27.126 STDOUT terraform:       + yaml_body               = (sensitive value)
18:41:27.126 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
18:41:27.126 STDOUT terraform:             apiVersion: redis.redis.opstreelabs.in/v1beta2
18:41:27.126 STDOUT terraform:             kind: Redis
18:41:27.126 STDOUT terraform:             metadata:
18:41:27.126 STDOUT terraform:               labels:
18:41:27.126 STDOUT terraform:                 env: prod
18:41:27.126 STDOUT terraform:                 module: data
18:41:27.126 STDOUT terraform:               name: redis-master
18:41:27.126 STDOUT terraform:               namespace: data-prod
18:41:27.126 STDOUT terraform:             spec:
18:41:27.126 STDOUT terraform:               kubernetesConfig:
18:41:27.126 STDOUT terraform:                 image: quay.io/opstree/redis:v7.0.15
18:41:27.126 STDOUT terraform:                 imagePullPolicy: IfNotPresent
18:41:27.126 STDOUT terraform:                 redisSecret:
18:41:27.126 STDOUT terraform:                   key: password
18:41:27.126 STDOUT terraform:                   name: redis-credentials
18:41:27.126 STDOUT terraform:                 resources:
18:41:27.126 STDOUT terraform:                   limits:
18:41:27.126 STDOUT terraform:                     cpu: 200m
18:41:27.126 STDOUT terraform:                     memory: 256Mi
18:41:27.126 STDOUT terraform:                   requests:
18:41:27.126 STDOUT terraform:                     cpu: 50m
18:41:27.126 STDOUT terraform:                     memory: 64Mi
18:41:27.126 STDOUT terraform:                 service:
18:41:27.126 STDOUT terraform:                   additional:
18:41:27.127 STDOUT terraform:                     enabled: false
18:41:27.127 STDOUT terraform:               redisConfig:
18:41:27.127 STDOUT terraform:                 additionalRedisConfig: |
18:41:27.127 STDOUT terraform:                   appendonly yes
18:41:27.127 STDOUT terraform:                   appendfsync everysec
18:41:27.127 STDOUT terraform:                   save 900 1
18:41:27.127 STDOUT terraform:                   save 300 10
18:41:27.127 STDOUT terraform:                   save 60 10000
18:41:27.127 STDOUT terraform:               storage:
18:41:27.127 STDOUT terraform:                 keepAfterDelete: true
18:41:27.127 STDOUT terraform:                 volumeClaimTemplate:
18:41:27.127 STDOUT terraform:                   spec:
18:41:27.127 STDOUT terraform:                     accessModes:
18:41:27.127 STDOUT terraform:                     - ReadWriteOnce
18:41:27.127 STDOUT terraform:                     resources:
18:41:27.127 STDOUT terraform:                       requests:
18:41:27.127 STDOUT terraform:                         storage: 2Gi
18:41:27.127 STDOUT terraform:                     storageClassName: local-path-retain
18:41:27.127 STDOUT terraform:         EOT
18:41:27.127 STDOUT terraform:       + yaml_incluster          = (sensitive value)
18:41:27.127 STDOUT terraform:     }
18:41:27.127 STDOUT terraform:   # kubernetes_namespace.data will be updated in-place
18:41:27.127 STDOUT terraform:   ~ resource "kubernetes_namespace" "data" {
18:41:27.127 STDOUT terraform:         id                               = "data-prod"
18:41:27.127 STDOUT terraform:       + wait_for_default_service_account = false
18:41:27.127 STDOUT terraform:       ~ metadata {
18:41:27.127 STDOUT terraform:           ~ labels           = {
18:41:27.127 STDOUT terraform:               - "layer"  = "L3" -> null
18:41:27.127 STDOUT terraform:               + "module" = "data"
18:41:27.127 STDOUT terraform:                 # (1 unchanged element hidden)
18:41:27.128 STDOUT terraform:             }
18:41:27.128 STDOUT terraform:             name             = "data-prod"
18:41:27.128 STDOUT terraform:             # (5 unchanged attributes hidden)
18:41:27.128 STDOUT terraform:         }
18:41:27.128 STDOUT terraform:     }
18:41:27.128 STDOUT terraform:   # time_sleep.wait_for_clickhouse_crd will be created
18:41:27.128 STDOUT terraform:   + resource "time_sleep" "wait_for_clickhouse_crd" {
18:41:27.128 STDOUT terraform:       + create_duration = "30s"
18:41:27.128 STDOUT terraform:       + id              = (known after apply)
18:41:27.128 STDOUT terraform:     }
18:41:27.128 STDOUT terraform:   # time_sleep.wait_for_postgresql_cluster will be created
18:41:27.128 STDOUT terraform:   + resource "time_sleep" "wait_for_postgresql_cluster" {
18:41:27.128 STDOUT terraform:       + create_duration = "60s"
18:41:27.128 STDOUT terraform:       + id              = (known after apply)
18:41:27.128 STDOUT terraform:     }
18:41:27.128 STDOUT terraform:   # time_sleep.wait_for_redis_crd will be created
18:41:27.128 STDOUT terraform:   + resource "time_sleep" "wait_for_redis_crd" {
18:41:27.128 STDOUT terraform:       + create_duration = "30s"
18:41:27.128 STDOUT terraform:       + id              = (known after apply)
18:41:27.128 STDOUT terraform:     }
18:41:27.128 STDOUT terraform:   # vault_database_secret_backend_connection.postgres will be created
18:41:27.128 STDOUT terraform:   + resource "vault_database_secret_backend_connection" "postgres" {
18:41:27.128 STDOUT terraform:       + allowed_roles     = [
18:41:27.128 STDOUT terraform:           + "postgres-readonly",
18:41:27.128 STDOUT terraform:           + "postgres-readwrite",
18:41:27.128 STDOUT terraform:         ]
18:41:27.128 STDOUT terraform:       + backend           = "database"
18:41:27.128 STDOUT terraform:       + id                = (known after apply)
18:41:27.128 STDOUT terraform:       + name              = "postgres"
18:41:27.128 STDOUT terraform:       + plugin_name       = (known after apply)
18:41:27.129 STDOUT terraform:       + verify_connection = true
18:41:27.129 STDOUT terraform:       + postgresql {
18:41:27.129 STDOUT terraform:           + connection_url          = (sensitive value)
18:41:27.129 STDOUT terraform:           + max_open_connections    = 2
18:41:27.129 STDOUT terraform:           + password_authentication = "password"
18:41:27.129 STDOUT terraform:         }
18:41:27.129 STDOUT terraform:     }
18:41:27.129 STDOUT terraform:   # vault_database_secret_backend_role.postgres_readonly will be created
18:41:27.129 STDOUT terraform:   + resource "vault_database_secret_backend_role" "postgres_readonly" {
18:41:27.129 STDOUT terraform:       + backend               = "database"
18:41:27.129 STDOUT terraform:       + creation_statements   = [
18:41:27.129 STDOUT terraform:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
18:41:27.129 STDOUT terraform:           + "GRANT SELECT ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
18:41:27.129 STDOUT terraform:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
18:41:27.129 STDOUT terraform:         ]
18:41:27.129 STDOUT terraform:       + credential_type       = (known after apply)
18:41:27.129 STDOUT terraform:       + db_name               = "postgres"
18:41:27.129 STDOUT terraform:       + default_ttl           = 3600
18:41:27.129 STDOUT terraform:       + id                    = (known after apply)
18:41:27.129 STDOUT terraform:       + max_ttl               = 86400
18:41:27.129 STDOUT terraform:       + name                  = "postgres-readonly"
18:41:27.129 STDOUT terraform:       + revocation_statements = [
18:41:27.129 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
18:41:27.129 STDOUT terraform:           + "DROP ROLE IF EXISTS \"{{name}}\";",
18:41:27.129 STDOUT terraform:         ]
18:41:27.129 STDOUT terraform:     }
18:41:27.130 STDOUT terraform:   # vault_database_secret_backend_role.postgres_readwrite will be created
18:41:27.130 STDOUT terraform:   + resource "vault_database_secret_backend_role" "postgres_readwrite" {
18:41:27.130 STDOUT terraform:       + backend               = "database"
18:41:27.130 STDOUT terraform:       + creation_statements   = [
18:41:27.130 STDOUT terraform:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
18:41:27.130 STDOUT terraform:           + "GRANT SELECT, INSERT, UPDATE, DELETE ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
18:41:27.130 STDOUT terraform:           + "GRANT USAGE, SELECT ON ALL SEQUENCES IN SCHEMA public TO \"{{name}}\";",
18:41:27.130 STDOUT terraform:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
18:41:27.130 STDOUT terraform:         ]
18:41:27.130 STDOUT terraform:       + credential_type       = (known after apply)
18:41:27.130 STDOUT terraform:       + db_name               = "postgres"
18:41:27.130 STDOUT terraform:       + default_ttl           = 3600
18:41:27.130 STDOUT terraform:       + id                    = (known after apply)
18:41:27.130 STDOUT terraform:       + max_ttl               = 86400
18:41:27.130 STDOUT terraform:       + name                  = "postgres-readwrite"
18:41:27.130 STDOUT terraform:       + revocation_statements = [
18:41:27.130 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
18:41:27.130 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL SEQUENCES IN SCHEMA public FROM \"{{name}}\";",
18:41:27.130 STDOUT terraform:           + "DROP ROLE IF EXISTS \"{{name}}\";",
18:41:27.130 STDOUT terraform:         ]
18:41:27.130 STDOUT terraform:     }
18:41:27.130 STDOUT terraform: Plan: 18 to add, 1 to change, 0 to destroy.
18:41:27.130 STDOUT terraform: Changes to Outputs:
18:41:27.130 STDOUT terraform:   + data_health_status            = {
18:41:27.131 STDOUT terraform:       + arangodb   = "deployed"
18:41:27.131 STDOUT terraform:       + clickhouse = "deployed"
18:41:27.131 STDOUT terraform:       + postgres   = "cnpg-cluster"
18:41:27.131 STDOUT terraform:       + redis      = "deployed"
18:41:27.131 STDOUT terraform:     }
18:41:27.131 STDOUT terraform:   + data_namespace                = "data-prod"
18:41:27.131 STDOUT terraform:   - l3_health_status              = {
18:41:27.131 STDOUT terraform:       - arangodb   = "deployed"
18:41:27.131 STDOUT terraform:       - clickhouse = "deployed"
18:41:27.131 STDOUT terraform:       - postgres   = "deployed"
18:41:27.131 STDOUT terraform:       - redis      = "deployed"
18:41:27.131 STDOUT terraform:     } -> null
18:41:27.131 STDOUT terraform:   - l3_namespace                  = "data-prod" -> null
18:41:27.131 STDOUT terraform:   ~ postgres_host                 = "postgresql.data-prod.svc.cluster.local" -> "postgresql-rw.data-prod.svc.cluster.local"
18:41:27.131 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
18:41:27.131 STDOUT terraform: Saved the plan to: tfplan
18:41:27.131 STDOUT terraform: To perform exactly these actions, run the following command to apply:
18:41:27.131 STDOUT terraform:     terraform apply "tfplan"
```

</details>
